{
  "backend/main.mo": "Primary backend actor defining types and state for retailers, products, listings, users, and permissions with migration, authorization, and storage mixins.",
  "backend/migration.mo": "Migration module converting old actor state to new formats, mainly adding createdAt to listings while preserving other stored data.",
  "feature_evidence.json": "Feature evidence report mapping features to relevant frontend files, components, and test IDs with high-confidence associations.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, their themes, behaviors, and structural roles across the app.",
  "frontend/index.css": "Tailwind base styles defining light/dark OKLCH color variables and shared UI tokens for the frontend theme.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router and app bootstrap configuring pages, routes, layout, admin protection, and global providers.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "UI card for confirming and executing a full system wipe, handling confirmation input, mutation state, and post-wipe recovery actions.",
  "frontend/src/components/admin/ProductEditDialog.tsx": "Dialog for editing a product’s name, category, and description with validation and update mutation handling.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Dialog for editing retailer details and operating hours, converting backend schedule formats and submitting updates.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Editor component for managing weekly operating hours and holiday overrides for retailers.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Searchable dropdown select using a popover and command menu to filter and choose options.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Non-visual component that triggers admin bootstrap logic when identity changes.",
  "frontend/src/components/auth/AdminOnly.tsx": "Wrapper that restricts content to authenticated admin users and shows appropriate access alerts.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Fullscreen overlay shown during login or actor initialization with loading feedback.",
  "frontend/src/components/brand/BrandImage.tsx": "Image component with fallback rendering for failed loads, supporting logo and hero styles.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "React error boundary that captures runtime and unhandled promise errors and displays a fallback screen.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "UI screen showing details of a runtime error with actions to reload or go home.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Hook providing search, category filtering, and price sorting for catalog items.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Fetches and displays featured product listings with images and links to product pages.",
  "frontend/src/components/shop/ShopFooter.tsx": "Footer showing credits, branding, and community message.",
  "frontend/src/components/shop/ShopHeader.tsx": "Header with branding, auth controls, and navigation for admin, shopper, and driver roles.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Hero section with branding, tagline, and hero image for the shop landing page.",
  "frontend/src/components/shop/ShopLayout.tsx": "Page layout wrapping content with header, footer, and auth initialization overlay.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and refreshes dependent queries.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Attempts one-time admin bootstrap on first load and updates related admin queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, wrapping AuthClient and exposing login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as provinces, retailers, listings, products, and role applications.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and theme variables for light and dark modes, including color tokens and layout utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/admin/AdminManageListingsPage.tsx": "Admin interface for viewing, grouping, creating, editing, and deleting product listings using various mutation hooks.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "Admin page for creating, editing, and deleting retailers, including schedule management and holiday overrides.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Dashboard for admins to manage products and listings, including creation forms, edits, deletions, and system maintenance actions.",
  "frontend/src/pages/shop/DriverDashboardPage.tsx": "Displays delivery-ready orders for drivers, allowing them to accept and mark deliveries as completed.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Shows available roles and handles user applications, including authentication and submission dialogs.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Allows master admins to review, approve, or reject pending role applications with approval and rejection dialogs.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Shows detailed product information with images and retailer listings, handling loading and not-found states.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Lists provinces for shoppers to browse local retailers and includes a call‑to‑action to join the platform.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Page with a form to submit new product or retailer requests, including validation and success/error handling.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Displays a retailer’s product catalog with search, sorting, product navigation, and loading/error states.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Lists retailers for a given town or suburb, handling loading, empty, and error cases.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Shows the user's role applications with status badges, dates, and loading/error handling.",
  "frontend/src/pages/shop/ShopperDashboardPage.tsx": "Dashboard for shoppers to view placed orders and perform accept or mark-done actions.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Lists towns within a province and lets users navigate to retailers in each town with loading and not-found handling.",
  "frontend/src/utils/money.ts": "Provides helpers to format, parse, and validate ZAR amounts stored as bigint rands.",
  "frontend/src/utils/productImages.ts": "Utility functions to select primary product images, list up to three images, generate blob URLs, and check remaining image slots.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds BASE_URL-safe paths to public assets for dev and production environments.",
  "frontend/src/utils/saProvinces.ts": "Exports a constant list of South African provinces and its corresponding type.",
  "frontend/src/utils/time.ts": "Converts IC bigint nanosecond timestamps into human‑readable date or date‑time strings.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and removing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Project metadata describing current features, new requests, and architectural notes for the admin listings dashboard."
}