{
  "backend/main.mo": "Defines the actor’s core domain types for products, listings, retailers, applications, and analytics, serving as the backend data model. Contains no functional logic beyond type declarations.",
  "backend/migration.mo": "Provides a migration function converting old listings into a new format by adding promo fields and setting updatedAt to createdAt. Returns an updated actor state with transformed listing entries.",
  "feature_evidence.json": "Contains feature evidence records mapping feature IDs to affected frontend files, components, and test IDs. Used for tracking implementation coverage and confidence.",
  "frontend-file-summaries.txt": "Lists pre-generated summaries for numerous frontend files, describing their roles, styling updates, and behavior. Functions as a reference index for existing frontend components.",
  "frontend/index.css": "Defines global Tailwind CSS variables for light and dark themes using OKLCH values. Applies base styling and sets theme-driven color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app at #root and loading main.tsx. Sets metadata and page title.",
  "frontend/src/App.tsx": "Wraps the app in error handling, theme provider, cart provider, and router. Also mounts the global toast system.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "Empty placeholder file for an admin danger‑zone system wipe card component.",
  "frontend/src/components/admin/ListingEditDialog.tsx": "Modal dialog for creating and editing listings with full promo configuration, validation, and integration with listing-related backend hooks. Loads product and retailer data, manages form state, and triggers create/update/promo actions.",
  "frontend/src/components/admin/ProductEditDialog.tsx": "Dialog for creating or editing a product, including fields, image upload, validation, and category management.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Dialog for creating or editing a retailer with contact info, location, and opening hours, including validation and submission.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Editor for weekly opening hours and holiday overrides, allowing toggling days, adjusting times, and managing holiday entries.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Searchable dropdown select component using a popover with filterable options.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Empty placeholder component.",
  "frontend/src/components/auth/AdminOnly.tsx": "Wrapper displaying a destructive alert indicating admin backend functionality is not yet implemented.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Overlay showing login or actor initialization progress during authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication state and errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog informing users that profile setup functionality is not yet implemented.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guard component blocking access for non-admin users and showing an access denied message.",
  "frontend/src/components/auth/RequireApproved.tsx": "Guard component requiring user approval, with admin bypass and approval request UI.",
  "frontend/src/components/auth/RequireAuth.tsx": "Guard requiring user authentication, showing login prompt when not logged in.",
  "frontend/src/components/brand/BrandImage.tsx": "Image component with error handling that swaps to themed fallback placeholders when loading fails.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "React error boundary that captures runtime and promise errors and displays a recovery screen.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "UI screen showing error details with options to reload or navigate home.",
  "frontend/src/components/shop/cart/CartProvider.tsx": "Context provider managing cart items with localStorage sync and utility helpers.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Hook providing search, category filtering, and sorting for catalogue items.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Empty file placeholder for catalogue preview section.",
  "frontend/src/components/shop/ShopFooter.tsx": "Footer showing copyright info and a referral link with gradient styling.",
  "frontend/src/components/shop/ShopHeader.tsx": "Responsive shop header with navigation, cart badge, authentication controls, and mobile menu.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Empty file placeholder for shop landing hero section.",
  "frontend/src/components/shop/ShopLayout.tsx": "Layout wrapper combining header, footer, auth overlay, and optional default-town setup.",
  "frontend/src/components/towns/DefaultTownSetupDialog.tsx": "Dialog prompting users to select and save a default town with async mutation handling.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching an authenticated or anonymous backend actor and refreshing dependent queries.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Empty file placeholder for admin bootstrap logic.",
  "frontend/src/hooks/useCatalog.ts": "Hook fetching the global product catalogue via the backend actor using react-query.",
  "frontend/src/hooks/useCategories.ts": "Provides hooks to list and create categories, merging frequent preset categories with backend data using React Query.",
  "frontend/src/hooks/useEnsureDefaultTownOsizweni.ts": "Auto-assigns 'Osizweni' as the default town for authenticated users lacking one, falling back to manual selection if unavailable or failing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines an Internet Identity context and provider managing authentication, identity loading, login, logout, and related state.",
  "frontend/src/hooks/useListings.ts": "Implements listing CRUD hooks and queries, including filtering by retailer or id, and invalidates related caches after mutations.",
  "frontend/src/hooks/useNomaYini.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useOrders.ts": "Provides hooks to list user orders, fetch individual orders, and create new orders with delivery and payment method handling.",
  "frontend/src/hooks/useProducts.ts": "Contains product listing, retrieval, creation, and update hooks, with cache invalidation for products, catalog, and categories.",
  "frontend/src/hooks/useQueries.ts": "Exposes approval and admin-related queries and mutations, including checking approval status and setting user approvals.",
  "frontend/src/hooks/useRetailerPortal.ts": "Adds retailer-portal queries for fetching the retailer profile, inventory, and orders tied to the authenticated retailer.",
  "frontend/src/hooks/useRetailers.ts": "Provides React Query hooks for listing, retrieving, creating, updating, and deleting retailers via an actor API.",
  "frontend/src/hooks/useRoleApplications.ts": "Empty placeholder file for role application hooks.",
  "frontend/src/hooks/useTownMembership.ts": "Defines React Query hooks and keys for town membership operations, all currently using unimplemented backend methods.",
  "frontend/src/hooks/useTowns.ts": "Includes types and React Query hooks for listing, creating, updating, and removing towns, but all backend calls are placeholders.",
  "frontend/src/hooks/useUserProfiles.ts": "Implements placeholder user profile query/mutation hooks with React Query, pending backend support.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/src/main.tsx": "Application entrypoint setting up React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/admin/AdminDriversPage.tsx": "Empty placeholder page for admin driver management.",
  "frontend/src/pages/admin/AdminManageListingsPage.tsx": "Admin UI for viewing, filtering, creating, editing, and deleting product listings using retailer and product data.",
  "frontend/src/pages/admin/AdminPickupPointsPage.tsx": "Empty placeholder page for admin pickup point management.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin UI for browsing, searching, creating, and editing products in the global catalogue.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "UI for listing, searching, creating, editing, and deleting retailers with dialogs and search filtering.",
  "frontend/src/pages/admin/AdminShoppersPage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/admin/AdminTownApplicationsPage.tsx": "Admin interface for approving or rejecting additional town membership applications using placeholder data.",
  "frontend/src/pages/admin/AdminTownsPage.tsx": "Admin page to list, create, edit, and remove towns with form handling and tabbed active/removed views.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Dashboard showing approval counts, products, listings, and actions to approve or reject users.",
  "frontend/src/pages/shop/CartPage.tsx": "Shopping cart UI allowing item quantity updates, removal, subtotal display, and cart clearing.",
  "frontend/src/pages/shop/CataloguePage.tsx": "Displays a browsable product catalogue with search, product filtering, and add‑to‑cart functionality.",
  "frontend/src/pages/shop/CheckoutPage.tsx": "Implements checkout flow including delivery options, payment selection, order submission, and success state handling.",
  "frontend/src/pages/shop/DriverDashboardPage.tsx": "Empty file with no implemented UI or logic.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Shows informational cards for driver, shopper, and pickup‑point roles with disabled application buttons and navigation to application status.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Empty file with no implemented UI or logic.",
  "frontend/src/pages/shop/MyOrdersPage.tsx": "Lists customer orders with statuses, totals, and navigation to detailed order views, including loading and error states.",
  "frontend/src/pages/shop/MyTownsPage.tsx": "Displays a user's towns and provides a form to apply for additional towns, with backend‑not‑implemented notice.",
  "frontend/src/pages/shop/OrderDetailPage.tsx": "Shows detailed order information including status, delivery method, payment method, and item breakdown with loading and error handling.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Empty file with no implemented UI or logic.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Landing page with hero section and feature cards introducing the platform and encouraging user onboarding.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Empty placeholder file for a product request page.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Empty placeholder file for a retailer catalog page.",
  "frontend/src/pages/shop/RetailerDashboardPage.tsx": "Retailer dashboard showing retailer info, inventory stats, and listing statuses with error and loading states.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Empty placeholder file for a retailer list page.",
  "frontend/src/pages/shop/RetailerOrderTrackingPage.tsx": "Retailer order tracking page displaying order statuses, tables, and navigation with loading and error handling.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Page showing stubbed role application tracking with prompt to apply if none exist.",
  "frontend/src/pages/shop/ShopperDashboardPage.tsx": "Empty placeholder file for a shopper dashboard page.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Empty placeholder file for a town/suburb list page.",
  "frontend/src/router/HashRouter.tsx": "Custom hash-based router mapping URL paths to pages with auth and admin guards.",
  "frontend/src/utils/externalBlobUrl.ts": "Utility to safely extract direct URLs from ExternalBlob objects with error handling.",
  "frontend/src/utils/money.ts": "Money utilities for formatting, parsing, and validating ZAR amounts.",
  "frontend/src/utils/productImages.ts": "Helpers for selecting primary images, listing product images, checking limits, and generating safe URLs.",
  "frontend/src/utils/publicAssetUrl.ts": "Build-safe helper for constructing public asset URLs respecting Vite BASE_URL.",
  "frontend/src/utils/saProvinces.ts": "List of South African provinces with a corresponding type.",
  "frontend/src/utils/themeAssets.ts": "Theme asset definitions using publicAssetUrl for logo and hero images.",
  "frontend/src/utils/time.ts": "Time utilities converting IC nanosecond timestamps to readable date and date-time strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from storage or the hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project state file describing the listings module goals, architecture notes, known issues, and feature definitions for admin, shopper, and checkout integrations."
}