{
  "backend/main.mo": "Defines the main backend actor with comprehensive domain types for products, retailers, listings, orders, applications, and analytics.",
  "backend/migration.mo": "Provides a no-op migration function for upgrading the canister state.",
  "feature_evidence.json": "Contains structured feature evidence metadata linking features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists prewritten summaries for various frontend files to support build planning.",
  "frontend/index.css": "Sets up global Tailwind styles and theme color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Wraps the application with providers and renders the HashRouter and global toaster.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/ProductEditDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Implements a searchable dropdown using popover and command components with selectable options.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Empty placeholder file.",
  "frontend/src/components/auth/AdminOnly.tsx": "Displays a destructive alert indicating that admin features require backend implementation.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Shows a loading overlay during identity login or actor initialization.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog informing users that profile setup functionality is not yet implemented.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guards content by checking admin status and showing an access-denied card if unauthorized.",
  "frontend/src/components/auth/RequireApproved.tsx": "Gates content behind approval checks, showing an approval request UI for non‑approved users while allowing admins through.",
  "frontend/src/components/auth/RequireAuth.tsx": "Ensures a user is authenticated before rendering children, otherwise displays a login prompt.",
  "frontend/src/components/brand/BrandImage.tsx": "Image component that swaps to themed fallback placeholders when the source fails to load.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "Global React error boundary that catches runtime and promise errors and displays a fallback screen.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "Error screen showing details and providing reload and home navigation options.",
  "frontend/src/components/shop/cart/CartProvider.tsx": "Cart context managing items, persistence, totals, and quantity/stock validation.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Hook providing search, category filtering, sorting, and derived product lists for catalog items.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/shop/ShopFooter.tsx": "Footer displaying copyright info and a link attribution with dynamic year and hostname.",
  "frontend/src/components/shop/ShopHeader.tsx": "Shop header with navigation, branding, cart indicator, mobile menu, and admin link support.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Empty file with no implementation.",
  "frontend/src/components/shop/ShopLayout.tsx": "Page layout wrapper providing header, footer, and an auth initialization overlay.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, reinitializing and invalidating queries on change.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useCatalog.ts": "Provides a placeholder global catalog query that currently returns an empty list.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and identity state.",
  "frontend/src/hooks/useListings.ts": "Defines React Query hooks for listing CRUD operations with placeholder backend calls and cache invalidation logic.",
  "frontend/src/hooks/useNomaYini.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useOrders.ts": "Offers React Query hooks for order creation, retrieval, filtering, and status updates, all using placeholder backend methods.",
  "frontend/src/hooks/useProducts.ts": "Implements product-related React Query hooks for listing, CRUD operations, and cache updates using stubbed backend methods.",
  "frontend/src/hooks/useQueries.ts": "Contains hooks for approval and admin-related queries and mutations against the backend actor.",
  "frontend/src/hooks/useRetailers.ts": "Provides retailer CRUD and listing hooks using React Query with unimplemented backend calls.",
  "frontend/src/hooks/useRoleApplications.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useTowns.ts": "Implements town listing and CRUD hooks using actor-backed backend calls with proper cache invalidation.",
  "frontend/src/hooks/useUserProfiles.ts": "Defines hooks for profile retrieval, saving, and role-based user listing with placeholder backend logic.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes plus shared container styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/admin/AdminDriversPage.tsx": "Empty admin page placeholder for managing drivers.",
  "frontend/src/pages/admin/AdminManageListingsPage.tsx": "Empty admin page placeholder for managing product listings.",
  "frontend/src/pages/admin/AdminPickupPointsPage.tsx": "Empty admin page placeholder for managing pickup points.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "Empty admin page placeholder for managing retailers.",
  "frontend/src/pages/admin/AdminShoppersPage.tsx": "Empty admin page placeholder for managing shoppers.",
  "frontend/src/pages/admin/AdminTownsPage.tsx": "Implements full CRUD UI for towns with dialogs, filtering, and status management using custom hooks.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Displays admin stats and handles user approval actions with tables and alerts.",
  "frontend/src/pages/shop/CartPage.tsx": "Renders the shopping cart with quantity controls, price totals, and cart management actions.",
  "frontend/src/pages/shop/CataloguePage.tsx": "Loads and filters the product catalogue with search, category filtering, and loading skeletons.",
  "frontend/src/pages/shop/CheckoutPage.tsx": "Handles checkout flow including delivery, payment options, order creation, and success state.",
  "frontend/src/pages/shop/DriverDashboardPage.tsx": "Empty driver dashboard placeholder page.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Renders role-application info cards and alerts, with disabled apply buttons and a link to view application status.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/shop/MyOrdersPage.tsx": "Lists customer orders with loading and empty states, showing alerts until backend support exists.",
  "frontend/src/pages/shop/OrderDetailPage.tsx": "Displays order details or loading/error states, with navigation back to the orders list.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Home page with hero section, feature cards, and optional CTA for authenticated users.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Shows application tracking placeholder with alert and link to apply.",
  "frontend/src/pages/shop/ShopperDashboardPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Empty placeholder file.",
  "frontend/src/router/HashRouter.tsx": "Implements hash-based routing with auth/admin guards and maps routes to shop pages.",
  "frontend/src/utils/money.ts": "Provides formatting, parsing, and validation utilities for ZAR amounts.",
  "frontend/src/utils/productImages.ts": "Helpers for selecting primary/all product images, generating safe URLs, and checking image limits.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds deployment-safe URLs for public assets using Vite's BASE_URL.",
  "frontend/src/utils/saProvinces.ts": "Exports a list and type for South African provinces.",
  "frontend/src/utils/themeAssets.ts": "Centralizes theme asset URLs using publicAssetUrl for deployment safety.",
  "frontend/src/utils/time.ts": "Formats IC nanosecond timestamps into readable date and date-time strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing) and persist them in sessionStorage, plus utilities to clear stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings, with typography, container-query, and animation plugins.",
  "project_state.json": "JSON describing project state, requirements, known issues, and pending feature requests for an admin-managed marketplace app."
}