{
  "backend/main.mo": "Main Motoko canister implementing product, retailer, listings, provinces, access control, user approval, and admin‑protected mutation/query APIs.",
  "backend/migration.mo": "Migration module copying stored state from an older version to the new actor structure without data transformation.",
  "feature_evidence.json": "Feature evidence metadata listing implemented features, impacted frontend files, components, test IDs, and confidence ratings.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their purpose, styling, and functionality.",
  "frontend/index.css": "Tailwind base stylesheet defining global OKLCH color tokens, dark‑mode variables, and shared element styles.",
  "frontend/index.html": "Root HTML file setting up the app container and loading the main React entry script.",
  "frontend/src/App.tsx": "Root React app wiring up routing, Internet Identity provider, React Query, admin bootstrap, and global error boundary.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Non‑visual component triggering admin bootstrap logic when identity changes.",
  "frontend/src/components/auth/AdminOnly.tsx": "Gatekeeper component that restricts content to admins and shows permission or login errors.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Overlay shown during login or actor initialization to display loading feedback.",
  "frontend/src/components/brand/BrandImage.tsx": "Image component with automatic fallback UI when the logo or hero image fails to load.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "A React error boundary that catches runtime and unhandled promise errors, logs them, and displays an error screen.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "Displays a styled error screen with error details and options to reload or return home.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "React hook providing search, category filtering, and sorting for catalog items.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Fetches and displays a preview grid of product listings, loading product details and enabling navigation to retailer pages.",
  "frontend/src/components/shop/ShopFooter.tsx": "Renders a site footer with branding, attribution, and community-related text.",
  "frontend/src/components/shop/ShopHeader.tsx": "Produces the main site header with branding, navigation, authentication controls, and admin access.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Shows the landing hero section with branding, descriptive text, and a hero image.",
  "frontend/src/components/shop/ShopLayout.tsx": "Page layout wrapper combining header, footer, and authentication overlay around main content.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the authenticated or anonymous backend actor, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Attempts one-time admin bootstrap via the backend and refreshes related queries, tracking attempts in session storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for managing Internet Identity authentication, including login, logout, and identity persistence. Also wraps the app with a provider that initializes AuthClient with custom options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as provinces, retailers, listings, products, and role applications. Integrates with useActor to ensure queries execute only when the actor is ready.",
  "frontend/src/index.css": "Configures Tailwind CSS base, components, and utilities with custom color variables for light and dark themes. Applies global styles including container presets and background/foreground defaults.",
  "frontend/src/main.tsx": "Bootstraps the React application by rendering App within QueryClientProvider and InternetIdentityProvider. Initializes the React Query client and imports global styles.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Renders an admin dashboard for managing products, retailers, and listings with forms, analytics cards, and related mutation handlers. Uses multiple query hooks to fetch needed data and update backend resources.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Displays available user roles with application workflows, handling login via Internet Identity and role application submission. Includes dialogs for submitting motivations and prevents Master Admin applications.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Provides an admin panel for reviewing, approving, and rejecting pending role applications. Includes dialogs for approval and rejection, date formatting, and displays application status with loading and error states.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Displays a product’s details and its retailer listings, including image handling, loading states, and navigation back to the retailer catalog.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Fetches and lists provinces for browsing retailers and products, with loading, error, and empty states plus promotional content.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Provides a form to request new products or retailers, including validation, submission handling, and success/error alerts.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Shows a retailer’s product catalog with search, filtering, sorting, and enriched product data loaded from backend queries.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Lists retailers in a selected town/suburb, handling loading, error, and empty states with navigation to individual retailer catalogs.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Displays a user's role applications with status badges, loading/error states, and navigation back to the Join Us page.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Shows towns/suburbs for a selected province with loading and not‑found states, allowing navigation to retailer listings.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds deployment‑safe URLs for public assets using Vite’s BASE_URL and normalized paths.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata, architecture notes, issues, generated assets, and implemented features for the ICP platform."
}