{
  "backend/main.mo": "Defines core backend data types for products, retailers, listings, applications, analytics, and user profiles in a Motoko actor.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Aggregated summary of multiple frontend files describing layout, pages, hooks, assets, and styling updates.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH CSS variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main app component wiring global providers, error boundary, theming, cart context, and router.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "Admin UI card allowing a full system wipe with confirmation dialog, success state, and logout flow.",
  "frontend/src/components/admin/ListingEditDialog.tsx": "Dialog for creating or editing product listings with pricing, stock, status, and promo controls using listing-related hooks.",
  "frontend/src/components/admin/ProductEditDialog.tsx": "Dialog for creating or editing products with fields, image upload, category management, and form submission.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Dialog for creating or editing retailers, handling contact info, address, province, and opening hours.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Editor component for managing weekly retailer hours and holiday overrides with toggles and time inputs.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Reusable searchable dropdown select using a popover and command list to pick options.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Empty placeholder component for future admin initialization logic.",
  "frontend/src/components/auth/AdminOnly.tsx": "Displays an alert indicating admin features are unavailable due to missing backend implementation.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Shows a loading overlay during Internet Identity login or first-time actor initialization.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for initial user profile creation with inputs and validation before saving.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Gatekeeper component that checks admin status and blocks access with an error card if unauthorized.",
  "frontend/src/components/auth/RequireApproved.tsx": "Gates content based on admin or approval status and shows an approval request flow if the user is not approved.",
  "frontend/src/components/auth/RequireApprovedDriver.tsx": "Restricts access to approved drivers, showing application, pending, or rejection states unless the user is an admin.",
  "frontend/src/components/auth/RequireApprovedShopper.tsx": "Blocks access to shopper-only pages unless approved, showing prompts for applying, pending review, or rejection details.",
  "frontend/src/components/auth/RequireAuth.tsx": "Ensures the user is authenticated, rendering a login prompt when no identity is present.",
  "frontend/src/components/brand/BrandImage.tsx": "Image component that swaps to styled fallback placeholders when loading fails.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "Global error boundary that catches runtime and unhandled promise errors and displays a fallback screen.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "UI screen showing error details with options to reload or return home.",
  "frontend/src/components/shop/cart/CartProvider.tsx": "Provides a React context for cart items with add, remove, update, and persistence via localStorage.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Manages catalog search, category filtering, and price sorting with memoized filtered results.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/shop/ShopFooter.tsx": "Displays footer with copyright info and a link attribution.",
  "frontend/src/components/shop/ShopHeader.tsx": "Renders the main shop header with navigation, authentication-aware links, and cart badge.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/shop/ShopLayout.tsx": "Wraps pages with shop header/footer and manages dialogs for auth initialization, town setup, and profile setup.",
  "frontend/src/components/towns/DefaultTownSetupDialog.tsx": "Dialog UI for selecting and setting a user's default town, with loading states and mutation handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdminOrders.ts": "Provides admin APIs to list all orders and update order status, with query invalidation.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useCatalog.ts": "Fetches the global product catalogue using the authenticated actor.",
  "frontend/src/hooks/useCategories.ts": "Fetches and merges frequent and backend categories, and provides a mutation to create new categories.",
  "frontend/src/hooks/useDriverApplication.ts": "Manages driver application queries and mutations, including submission with uploaded KYC blobs.",
  "frontend/src/hooks/useDriverOrders.ts": "Lists eligible driver orders with polling using the authenticated actor.",
  "frontend/src/hooks/useEnsureDefaultTownOsizweni.ts": "Stub hook that checks default town and logs skipping auto-assignment until backend support exists.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading identities and exposing login/clear actions.",
  "frontend/src/hooks/useListings.ts": "Provides React Query hooks for listing CRUD operations and cache invalidation tied to product, retailer, and catalog data.",
  "frontend/src/hooks/useNomaYini.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/hooks/useOrders.ts": "Contains hooks for listing, fetching, and creating orders, including delivery and payment handling with cache updates.",
  "frontend/src/hooks/usePickupPointApplication.ts": "Implements hooks for submitting and retrieving pickup point applications and status with query invalidation.",
  "frontend/src/hooks/useProducts.ts": "Supplies hooks for product listing, retrieval, creation, and updates, with cache coordination across product, catalog, and category queries.",
  "frontend/src/hooks/useQueries.ts": "Holds approval- and admin-related hooks for checking approval status, requesting approval, and managing user approvals.",
  "frontend/src/hooks/useRetailerPortal.ts": "Defines hooks for fetching retailer-specific data including profile, inventory, and orders.",
  "frontend/src/hooks/useRetailers.ts": "Provides retailer CRUD hooks and related query invalidations for retailer data.",
  "frontend/src/hooks/useRoleApplications.ts": "Includes hooks for managing shopper, pickup point, and driver role applications with approve/reject mutations.",
  "frontend/src/hooks/useShopperApplication.ts": "Hooks for fetching shopper application/status and submitting a new application with react-query.",
  "frontend/src/hooks/useShopperOrders.ts": "Hooks to list eligible/assigned orders, fetch order details, and accept or complete shopper orders.",
  "frontend/src/hooks/useSystemSettings.ts": "Provides a placeholder mutation for system wipe that currently throws and clears query cache on success.",
  "frontend/src/hooks/useTownMembership.ts": "Stubbed hooks for town membership queries and mutations, all disabled until backend support exists.",
  "frontend/src/hooks/useTowns.ts": "Stubbed town management hooks for listing, creating, updating, and removing towns, pending backend implementation.",
  "frontend/src/hooks/useUserProfiles.ts": "Hooks for fetching and saving user profiles, including caller and specific user profiles via actor methods.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark mode color variables and base component styles.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClientProvider, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/admin/AdminDriversPage.tsx": "Admin UI page for viewing, approving, and rejecting driver applications with dialogs and table views.",
  "frontend/src/pages/admin/AdminManageListingsPage.tsx": "Provides an interface to search, create, edit, and delete product–retailer listings with status badges and dialogs for editing and deletion.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders with filtering, detail dialogs, and tools to update order status including assignment to shoppers or drivers.",
  "frontend/src/pages/admin/AdminPickupPointsPage.tsx": "Manages pickup point applications, allowing admins to view details, approve, or reject applications with reasons.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Enables search, creation, and editing of products in the global catalogue, with a product list and an edit dialog.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "Handles listing, searching, creation, editing, and deletion of retailer records with confirmation dialogs.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Shows system settings placeholders and includes a danger zone section for wiping system data.",
  "frontend/src/pages/admin/AdminShoppersPage.tsx": "Displays and manages shopper applications, allowing admins to view details, approve, or reject applicants with reasons.",
  "frontend/src/pages/admin/AdminTownApplicationsPage.tsx": "Static page explaining that town applications are no longer needed and providing navigation back to the admin dashboard.",
  "frontend/src/pages/admin/AdminTownsPage.tsx": "Admin interface for listing, creating, editing, and removing towns, with form handling and confirmation dialogs.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Admin dashboard linking to management pages for shoppers, drivers, pickup points, retailers, and products.",
  "frontend/src/pages/shop/CartPage.tsx": "Shopping cart page showing cart items, quantity controls, totals, and actions to clear the cart or proceed.",
  "frontend/src/pages/shop/CataloguePage.tsx": "Catalogue browser with search, product listing, and add‑to‑cart functionality using global catalogue data.",
  "frontend/src/pages/shop/CheckoutPage.tsx": "Handles checkout flow including delivery options, payment type, validation, and order submission with success and empty-cart states.",
  "frontend/src/pages/shop/DriverApplicationPage.tsx": "Provides a driver application form with validation, selfie upload, and submission while handling existing applications and errors.",
  "frontend/src/pages/shop/DriverDashboardPage.tsx": "Displays eligible delivery orders for drivers with status badges, formatting helpers, and loading/error handling.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Landing page linking to applications for driver, shopper, and pickup point roles, plus application status access.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/shop/MyOrdersPage.tsx": "Shows a customer’s order history with status badges, totals, and navigation to order details, including loading and error states.",
  "frontend/src/pages/shop/MyTownsPage.tsx": "Lets users manage favorite towns, add or remove towns, and view default and additional towns with validation and dialogs.",
  "frontend/src/pages/shop/OrderDetailPage.tsx": "Displays detailed order info, including status, delivery method, payment, and loading/error handling.",
  "frontend/src/pages/shop/PickupPointApplicationPage.tsx": "Form page for submitting a pickup point application with image upload, validation, and progress tracking.",
  "frontend/src/pages/shop/PickupPointDashboardPage.tsx": "Placeholder dashboard for pickup point users with basic UI and future feature notice.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Empty file; no implementation provided.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Landing-style page showing hero content and platform features with optional CTA based on login state.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Empty file; no implementation provided.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Empty file; no implementation provided.",
  "frontend/src/pages/shop/RetailerDashboardPage.tsx": "Retailer dashboard displaying retailer info, inventory stats, and listing details with loading/error states.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Empty file; no implementation provided.",
  "frontend/src/pages/shop/RetailerOrderTrackingPage.tsx": "Displays retailer-related orders with status badges, loading/error handling, and navigation.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Displays the user’s shopper, pickup point, and driver application statuses, showing badges and detailed messages for each state.",
  "frontend/src/pages/shop/ShopperApplicationPage.tsx": "Provides a form for submitting a shopper application with selfie upload, validation, and progress tracking.",
  "frontend/src/pages/shop/ShopperDashboardPage.tsx": "Shows available and assigned shopper orders, with actions to accept or complete orders and view details.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Empty file with no implemented functionality.",
  "frontend/src/router/HashRouter.tsx": "Defines the app’s route structure, authentication gates, and page mappings using TanStack Router.",
  "frontend/src/utils/externalBlobUrl.ts": "Safely extracts a direct URL from an ExternalBlob with error handling.",
  "frontend/src/utils/fileBytes.ts": "Converts files to byte arrays and validates image file type and size.",
  "frontend/src/utils/money.ts": "Formats, parses, and validates ZAR currency values.",
  "frontend/src/utils/productImages.ts": "Provides helpers for selecting product images, generating URLs, and checking image limits.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds deployment-safe URLs for public assets using Vite’s base URL.",
  "frontend/src/utils/saProvinces.ts": "Exports a list and type of all South African provinces.",
  "frontend/src/utils/themeAssets.ts": "Defines theme image asset paths resolved through publicAssetUrl.",
  "frontend/src/utils/time.ts": "Formats IC timestamp bigints into readable date or date-time strings.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL params (query or hash), storing/retrieving them in sessionStorage, and clearing them from session or the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending theme colors, fonts, animations, and container settings, and enabling plugins for typography, container queries, and animation.",
  "project_state.json": "Project metadata describing current app state, incremental build constraints, existing features, and pending feature requests for the pickup‑point workflow."
}