{
  "backend/main.mo": "Defines the main actor with product, retailer, listing, application, and order-related types plus migration integration.",
  "backend/migration.mo": "Defines legacy data types and migration structures for converting old state to new formats.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend files and components.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app.",
  "frontend/src/App.tsx": "Sets up global providers and renders the router and toaster within an error boundary.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/ProductEditDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Implements a searchable dropdown using popover and command components.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Empty placeholder file.",
  "frontend/src/components/auth/AdminOnly.tsx": "Wrapper showing a destructive alert indicating admin backend functions are not implemented.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Displays a full‑screen loading overlay during identity login or actor initialization.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that manages Internet Identity auth and handles login errors while updating React Query cache.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Simple dialog placeholder indicating upcoming profile setup functionality.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Wrapper that checks admin status and blocks access with an error card if the user is not an admin.",
  "frontend/src/components/auth/RequireApproved.tsx": "Gatekeeper component that requires account approval, allowing admins through and offering an approval request flow.",
  "frontend/src/components/auth/RequireAuth.tsx": "Protects routes by requiring an authenticated identity and showing a login prompt if missing.",
  "frontend/src/components/brand/BrandImage.tsx": "Image component with graceful fallback placeholders when loading fails.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "Top-level error boundary that captures runtime and unhandled promise errors and displays a fallback screen.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "UI screen displaying unexpected runtime errors with options to reload or return home.",
  "frontend/src/components/shop/cart/CartProvider.tsx": "Context provider managing cart state with add, remove, quantity updates, totals, and localStorage persistence.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Hook providing search, filter, and sort controls for a product catalogue with derived category lists.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Empty placeholder file for a catalogue preview section.",
  "frontend/src/components/shop/ShopFooter.tsx": "Footer showing copyright info and a link to caffeine.ai with year and host tracking.",
  "frontend/src/components/shop/ShopHeader.tsx": "Responsive shop header with navigation, cart display, login button, and admin link handling.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Empty placeholder file for the shop landing hero section.",
  "frontend/src/components/shop/ShopLayout.tsx": "Layout wrapper composing header, footer, and auth initialization overlay around shop pages.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Empty hook file with no implementation.",
  "frontend/src/hooks/useCatalog.ts": "Defines catalog query keys and a placeholder hook returning an empty global catalogue until backend support exists.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useListings.ts": "Defines listing query keys and placeholder CRUD hooks that currently return empty data or throw until backend methods are implemented.",
  "frontend/src/hooks/useNomaYini.ts": "Empty hook file with no implementation.",
  "frontend/src/hooks/useOrders.ts": "Defines order query keys and placeholder order-related queries and mutations that return empty data or throw until backend support exists.",
  "frontend/src/hooks/useProducts.ts": "Provides product query keys and placeholder CRUD hooks using the actor but with unimplemented backend methods.",
  "frontend/src/hooks/useQueries.ts": "Implements approval-related queries and mutations using the actor, with support for checking and setting approval and admin status.",
  "frontend/src/hooks/useRetailers.ts": "Defines retailer query keys and placeholder CRUD hooks returning empty data or throwing until backend methods are added.",
  "frontend/src/hooks/useRoleApplications.ts": "Empty hook file with no implementation.",
  "frontend/src/hooks/useTowns.ts": "Defines town query keys and placeholder hooks for listing, creating, and deleting towns with unimplemented backend logic.",
  "frontend/src/hooks/useUserProfiles.ts": "Defines React Query hooks for fetching and saving user profiles; all backend calls are placeholders returning null or empty data.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and shared utility styles.",
  "frontend/src/main.tsx": "App entry point initializing React Query, Internet Identity provider, and rendering the main App component.",
  "frontend/src/pages/admin/AdminDriversPage.tsx": "Empty admin page placeholder for driver management.",
  "frontend/src/pages/admin/AdminManageListingsPage.tsx": "Empty admin page placeholder for listings management.",
  "frontend/src/pages/admin/AdminPickupPointsPage.tsx": "Empty admin page placeholder for pickup point management.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "Empty admin page placeholder for retailer management.",
  "frontend/src/pages/admin/AdminShoppersPage.tsx": "Empty admin page placeholder for shopper management.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Admin dashboard showing user approval stats and allowing approving or rejecting pending users.",
  "frontend/src/pages/shop/CartPage.tsx": "Displays and manages the shopping cart, allowing quantity updates, item removal, and clearing the cart.",
  "frontend/src/pages/shop/CataloguePage.tsx": "Shows product catalogue with search and category filters; relies on backend data and includes loading and error states.",
  "frontend/src/pages/shop/CheckoutPage.tsx": "Checkout flow handling delivery, payment, order submission, and success UI; order creation uses a backend hook.",
  "frontend/src/pages/shop/DriverDashboardPage.tsx": "Empty page placeholder for driver dashboard functionality.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "UI page describing upcoming role applications with cards for driver, shopper, and pickup point roles, plus a link to application status.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/pages/shop/MyOrdersPage.tsx": "Displays user orders with loading, error, empty states, and navigation to catalogue; actual order data pending backend.",
  "frontend/src/pages/shop/OrderDetailPage.tsx": "Shows order details or loading/error states, with placeholder content until backend is implemented.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Home page with hero section, feature cards, and optional join button, introducing the platform.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "UI page showing placeholder application tracking state with option to navigate to join page.",
  "frontend/src/pages/shop/ShopperDashboardPage.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/router/HashRouter.tsx": "Custom hash-based router mapping paths to pages with auth/admin guards and navigation helper.",
  "frontend/src/utils/money.ts": "Utilities for formatting, parsing, and validating South African Rand values.",
  "frontend/src/utils/productImages.ts": "Helpers for selecting primary and additional product images, generating URLs, and checking image limits.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds deployment-safe URLs for public assets using Vite's base URL.",
  "frontend/src/utils/saProvinces.ts": "Exports a constant list and type for South African provinces.",
  "frontend/src/utils/themeAssets.ts": "Defines theme asset URLs for logo and hero images using publicAssetUrl.",
  "frontend/src/utils/time.ts": "Converts IC timestamp values to readable date and datetime strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes overall project state, features, architecture notes, image requirements, and known issues for the ordering app."
}