{
  "backend/main.mo": "Defines the main backend actor with types for products, listings, retailers, applications, and related domain models.",
  "feature_evidence.json": "Empty feature evidence report structure with no features listed.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for reference.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens and dark mode variants for global theming.",
  "frontend/index.html": "Minimal HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component wiring ThemeProvider, error boundary, cart provider, router, and toaster.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "Admin card enabling full system wipe with confirmation dialog, success state, and logout handling.",
  "frontend/src/components/admin/ListingEditDialog.tsx": "Dialog for creating or editing listings with price, stock, status, and promo configuration.",
  "frontend/src/components/admin/ProductEditDialog.tsx": "Dialog for creating or editing products with category selection, image upload, and validation.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Dialog form for creating or editing a retailer, handling validation, opening hours, and submission to backend hooks.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Editor for weekly opening hours and holiday overrides, allowing toggling days, adjusting times, and managing holiday entries.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Searchable dropdown select component using a popover and command list with filtering and option selection.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Empty placeholder component file.",
  "frontend/src/components/auth/AdminOnly.tsx": "Displays a destructive alert indicating admin backend functionality is not implemented.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Full-screen loading overlay shown during Internet Identity login or actor initialization.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity auth flow with error handling and cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for collecting and submitting initial user profile details with validation and error handling.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Wrapper that restricts children to admins, showing an access-denied card when the caller is not an admin.",
  "frontend/src/components/auth/RequireApproved.tsx": "Gatekeeping component requiring user approval, offering approval request flow for non-admin users.",
  "frontend/src/components/auth/RequireAuth.tsx": "Requires authenticated identity, prompting login when unauthenticated and rendering children otherwise.",
  "frontend/src/components/brand/BrandImage.tsx": "Image component with error fallback rendering branded placeholders when the source fails to load.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "React error boundary that catches rendering, runtime, and unhandled promise errors and displays an error screen.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "UI screen that shows error details and provides actions to reload the page or return home.",
  "frontend/src/components/shop/cart/CartProvider.tsx": "Context provider managing cart items with localStorage persistence and utility functions.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Hook providing search, category filtering, and sorting utilities for catalog items.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/shop/ShopFooter.tsx": "Footer displaying copyright info and a caffeine.ai attribution link.",
  "frontend/src/components/shop/ShopHeader.tsx": "Header with navigation, cart indicator, login button, and mobile menu for the shop interface.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Empty file with no implementation.",
  "frontend/src/components/shop/ShopLayout.tsx": "Page layout wrapping content with header, footer, and dialogs for auth, profile, and town setup.",
  "frontend/src/components/towns/DefaultTownSetupDialog.tsx": "Dialog prompting users to select and set their default town with validation and async submission.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching an authenticated or anonymous backend actor and invalidating dependent queries.",
  "frontend/src/hooks/useAdminOrders.ts": "Hooks for admins to list all orders and update order status with react-query caching.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useCatalog.ts": "Hook fetching the global shop catalogue using the backend actor and react-query.",
  "frontend/src/hooks/useCategories.ts": "Provides React Query hooks to list and create categories, merging backend and predefined frequent categories.",
  "frontend/src/hooks/useEnsureDefaultTownOsizweni.ts": "A hook that checks default town membership and logs a placeholder for future auto‑assignment of 'Osizweni'.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, logout, and identity state handling using Dfinity AuthClient.",
  "frontend/src/hooks/useListings.ts": "Defines React Query hooks for listing, fetching, creating, updating, and deleting product listings via the backend actor.",
  "frontend/src/hooks/useNomaYini.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useOrders.ts": "Provides hooks to list customer orders, fetch order details, and create new orders with delivery and payment options.",
  "frontend/src/hooks/useProducts.ts": "React Query hooks for listing, fetching, creating, and updating products, with cache invalidation across related queries.",
  "frontend/src/hooks/useQueries.ts": "Contains approval- and admin‑related query hooks for checking and setting user approval and admin status.",
  "frontend/src/hooks/useRetailerPortal.ts": "Hooks for fetching the current retailer, its inventory, and its orders for the retailer portal.",
  "frontend/src/hooks/useRetailers.ts": "Provides React Query hooks for listing, retrieving, creating, updating, and deleting retailers via the actor API.",
  "frontend/src/hooks/useRoleApplications.ts": "Defines driver and shopper application types and hooks for querying and managing role‑based applications; many driver methods are placeholders.",
  "frontend/src/hooks/useShopperApplication.ts": "Hooks for fetching the caller's shopper application and status and submitting new shopper applications.",
  "frontend/src/hooks/useSystemSettings.ts": "Contains a mutation hook for system wipe functionality, currently unimplemented.",
  "frontend/src/hooks/useTownMembership.ts": "Provides town‑membership hooks for querying and modifying default and favorite towns, all currently disabled or unimplemented.",
  "frontend/src/hooks/useTowns.ts": "Defines town types and hooks for listing, creating, updating, and removing towns, with backend functions not yet implemented.",
  "frontend/src/hooks/useUserProfiles.ts": "Hooks for fetching and saving user profiles, including caller and specific‑user variants.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry that initializes React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/admin/AdminDriversPage.tsx": "Admin UI for viewing, approving, and rejecting driver applications using role‑application hooks.",
  "frontend/src/pages/admin/AdminManageListingsPage.tsx": "Admin UI for viewing, searching, creating, editing, and deleting product-to-retailer listings with dialogs and status badges.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin interface to list orders, filter by status, view details, and update order statuses with optional assignment fields.",
  "frontend/src/pages/admin/AdminPickupPointsPage.tsx": "Empty placeholder page for managing pickup points.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page for searching, viewing, creating, and editing products in the global catalogue.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "Admin page for listing, searching, creating, editing, and deleting retailers with confirmation dialogs.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "System settings page with placeholders for future configurations and a danger‑zone system wipe component.",
  "frontend/src/pages/admin/AdminShoppersPage.tsx": "Admin workflow for reviewing, approving, or rejecting personal shopper applications with detailed dialogs.",
  "frontend/src/pages/admin/AdminTownApplicationsPage.tsx": "Informational page explaining that town membership applications are no longer required.",
  "frontend/src/pages/admin/AdminTownsPage.tsx": "UI for admins to view, create, edit, and remove towns with form handling and tabbed active/removed lists.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Admin dashboard showing stats and allowing approval or rejection of users.",
  "frontend/src/pages/shop/CartPage.tsx": "Shopping cart page with item quantity controls, removal, and subtotal calculation.",
  "frontend/src/pages/shop/CataloguePage.tsx": "Product catalogue with search, listing filters, and add‑to‑cart actions.",
  "frontend/src/pages/shop/CheckoutPage.tsx": "Checkout form handling delivery, payment options, order submission, and success flow.",
  "frontend/src/pages/shop/DriverDashboardPage.tsx": "Empty placeholder file for the driver dashboard page.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Page presenting application options for drivers, shoppers, and pickup points with navigation.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Empty placeholder file for master admin role applications page.",
  "frontend/src/pages/shop/MyOrdersPage.tsx": "Displays a list of the user's orders with statuses, totals, and navigation to order details, including loading and error states.",
  "frontend/src/pages/shop/MyTownsPage.tsx": "Allows users to view and manage their default and favorite towns, including adding and removing towns with loading and confirmation states.",
  "frontend/src/pages/shop/OrderDetailPage.tsx": "Shows detailed information for a specific order, including status, delivery and payment methods, with loading and error handling.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Empty placeholder file for product detail functionality.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Renders a marketing-style landing page introducing the platform and its features, with optional navigation for authenticated users.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Empty placeholder file for requesting new products.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Empty placeholder file for browsing a retailer’s product catalog.",
  "frontend/src/pages/shop/RetailerDashboardPage.tsx": "Provides retailer-specific dashboard showing retailer info, inventory, and listing statuses with loading and error handling.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Empty placeholder file for listing retailers.",
  "frontend/src/pages/shop/RetailerOrderTrackingPage.tsx": "Displays retailer order tracking with status badges, loading/error states, and a table of orders fetched from the retailer portal.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Shows the user's shopper application status with badges, messages, and a prompt to apply if none exists.",
  "frontend/src/pages/shop/ShopperApplicationPage.tsx": "Form page for submitting a shopper application including personal info, selfie upload, validation, and upload progress tracking.",
  "frontend/src/pages/shop/ShopperDashboardPage.tsx": "Empty placeholder page for shopper dashboard functionality.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Empty placeholder page for listing towns or suburbs.",
  "frontend/src/router/HashRouter.tsx": "Implements hash-based routing, mapping routes to pages with auth/admin guards where required.",
  "frontend/src/utils/externalBlobUrl.ts": "Provides a safe helper to extract a direct URL from an ExternalBlob with error handling.",
  "frontend/src/utils/fileBytes.ts": "Utilities to convert files to byte arrays and validate image files by type and size.",
  "frontend/src/utils/money.ts": "Utilities for formatting, parsing, and validating ZAR currency values.",
  "frontend/src/utils/productImages.ts": "Helpers for selecting primary/all product images, creating safe URLs, and checking image slot limits.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds deployment-safe URLs for public assets using Vite's BASE_URL handling.",
  "frontend/src/utils/saProvinces.ts": "Exports the list and type of South African provinces.",
  "frontend/src/utils/themeAssets.ts": "Defines centralized theme asset URLs for branding using publicAssetUrl.",
  "frontend/src/utils/time.ts": "Formats IC timestamps into readable date or date-time strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state file describing scope, architectural notes, known issues, and existing features with metadata."
}