{
  "backend/main.mo": "Main backend actor defining core types (Product, Listing, Retailer, Order, etc.) and data structures for the Thuma Thina marketplace, including user profiles, driver/shopper/pickup point applications, and sales analytics.",
  "feature_evidence.json": "Feature evidence report documenting two features related to updating MyTownsPage to display towns interface for all authenticated users (not just admins) and showing the town selection dropdown for all users.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files describing the warm African-inspired theme, shop layout components, pages for provinces/towns/retailers/products, catalog controls, and user profile/town setup dialogs.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system CSS variables for light and dark modes with warm, African-inspired tones for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Thuma Thina' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the application with GlobalErrorBoundary, ThemeProvider, CartProvider, HashRouter, and Toaster for notifications.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "Admin card component for wiping all system data with confirmation dialog requiring 'WIPE' text input, success state display, and logout/reload functionality after wipe completion.",
  "frontend/src/components/admin/ListingEditDialog.tsx": "Dialog component for creating/editing product listings with fields for retailer, product, price, stock, status, and optional promotional pricing with start/end dates, using ZAR currency formatting.",
  "frontend/src/components/admin/ProductEditDialog.tsx": "Dialog component for creating and editing products with fields for name, description, category, and image upload. Includes category creation functionality and integrates with product and category mutation hooks.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Dialog component for creating and editing retailers with contact details, location (province/town), and opening hours. Uses tabs to organize basic info and hours, integrating with retailer mutation hooks.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Editor component for managing retailer weekly schedules and holiday overrides. Allows toggling days, setting open/close times, and adding/removing holiday exceptions.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Reusable searchable dropdown select component built with Command and Popover primitives. Provides filtering and keyboard navigation for option selection.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Empty file, likely placeholder for admin initialization logic.",
  "frontend/src/components/auth/AdminOnly.tsx": "Component that displays a warning alert indicating admin functionality requires backend implementation. Acts as a placeholder for unimplemented admin features.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Full-screen loading overlay shown during Internet Identity login and actor initialization. Tracks initialization state per principal to avoid redundant loading screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that handles Internet Identity login/logout with loading states. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup requiring name, email, phone, and default town selection. Non-dismissible until profile is completed.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Route guard component that checks admin status and displays access denied message for non-admin users. Shows loading state during verification.",
  "frontend/src/components/auth/RequireApproved.tsx": "Renders children only if the user is approved or an admin; otherwise displays a card prompting the user to request approval with status feedback.",
  "frontend/src/components/auth/RequireApprovedDriver.tsx": "Guards driver-only routes by checking driver application status (pending, rejected, or approved); admins bypass the check, and unapproved users see status-specific messages with navigation options.",
  "frontend/src/components/auth/RequireApprovedPickupPoint.tsx": "Restricts access to pickup point areas by verifying approved status; shows application prompts or rejection messages for non-approved users, while admins bypass the check.",
  "frontend/src/components/auth/RequireApprovedShopper.tsx": "Guards personal shopper dashboard routes by checking shopper application status; displays application prompts or rejection details for non-approved users, with admin bypass.",
  "frontend/src/components/auth/RequireAuth.tsx": "Renders children only if the user is authenticated; otherwise displays a login prompt card with a LoginButton component.",
  "frontend/src/components/brand/BrandImage.tsx": "Reusable image component with error handling that displays themed fallback placeholders (logo or hero style) when image loading fails.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "React error boundary that catches component errors, unhandled promise rejections, and runtime errors, displaying UnexpectedRuntimeErrorScreen when errors occur.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "Full-screen error UI displaying error details with options to reload the page or navigate home, styled with alert and card components.",
  "frontend/src/components/shop/cart/CartProvider.tsx": "React context provider that manages shopping cart state with localStorage persistence, providing methods to add, remove, update quantities, clear cart, and calculate totals. Exposes cart functionality through useCart hook.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Custom hook that manages catalog filtering and sorting logic, providing search query, category filter, and price sorting (ascending/descending) functionality with memoized filtered results and category extraction.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Empty file with no content.",
  "frontend/src/components/shop/ShopFooter.tsx": "Footer component displaying copyright, current year, and a 'Built with caffeine.ai' attribution link with UTM tracking parameters.",
  "frontend/src/components/shop/ShopHeader.tsx": "Main navigation header component that displays logo, navigation links (Home, Shop, Join Us, My Towns, role-specific dashboards), cart icon with item count badge, and login/logout buttons. Conditionally shows navigation items based on authentication status and user roles (admin, shopper, driver, pickup point).",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Empty file with no content.",
  "frontend/src/components/shop/ShopLayout.tsx": "Main layout wrapper component that renders ShopHeader, ShopFooter, and children content, while managing authentication overlays and conditional dialogs for profile setup and default town selection based on user authentication and profile state.",
  "frontend/src/components/towns/DefaultTownSetupDialog.tsx": "Modal dialog component that forces users to select a default town from active towns list before continuing, with non-dismissible behavior and integration with user profile saving.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, creating anonymous or authenticated actors based on identity state, initializing access control with admin token, and invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useAdminOrders.ts": "React Query hooks for admin order management, providing functionality to list all orders and update order status with automatic cache invalidation.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Empty file with no content.",
  "frontend/src/hooks/useCatalog.ts": "React Query hook that fetches the global product catalog from the backend actor.",
  "frontend/src/hooks/useCategories.ts": "Provides hooks for category management with a predefined list of 50+ frequent product categories (groceries, household, health, etc.), merging them with backend categories, and supporting category creation with cache invalidation.",
  "frontend/src/hooks/useDriverApplication.ts": "React Query hooks for driver application management, providing functionality to fetch driver application status, retrieve full application details, and submit new applications with KYC documents (selfie).",
  "frontend/src/hooks/useDriverOrders.ts": "React Query hook that fetches eligible driver orders from the backend with 10-second polling interval for real-time updates.",
  "frontend/src/hooks/useEnsureDefaultTownOsizweni.ts": "Hook that would automatically assign 'Osizweni' as the default town for authenticated users, but is currently disabled because town management backend methods are not yet implemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with support for delegation identity validation.",
  "frontend/src/hooks/useListings.ts": "React Query hooks for managing product listings (CRUD operations), including filtering by retailer/product, setting promos, and invalidating related caches for products, retailers, and catalog.",
  "frontend/src/hooks/useNomaYini.ts": "Empty file with no content.",
  "frontend/src/hooks/useOrders.ts": "React Query hooks for order management, including fetching customer orders, creating orders with delivery methods (home/pickup point) and payment methods (ZAR/ICP/nomayini).",
  "frontend/src/hooks/usePickupPointApplication.ts": "Hooks for managing pickup point applications, including fetching application status, submitting new applications with business details and images, and querying pending applications.",
  "frontend/src/hooks/usePickupPointOrders.ts": "Hooks for creating and listing pickup orders associated with a pickup point, with cache invalidation for orders and catalog.",
  "frontend/src/hooks/useProducts.ts": "React Query hooks for product CRUD operations, including listing all products, fetching individual products by ID, and creating/updating products with categories and images.",
  "frontend/src/hooks/useQueries.ts": "Hooks for user approval management and admin checks, including requesting approval, listing approvals, setting approval status, and checking if the caller is an admin.",
  "frontend/src/hooks/useRetailerPortal.ts": "Hooks for retailer-specific queries, including fetching the authenticated user's retailer profile, their inventory listings, and orders associated with their retailer account.",
  "frontend/src/hooks/useRetailers.ts": "Provides React Query hooks for CRUD operations on retailers, including list, get, create, update, and delete with query key management and cache invalidation.",
  "frontend/src/hooks/useRoleApplications.ts": "Exports React Query hooks for managing role applications (personal shopper, pickup point, driver) with approve/reject mutations and query invalidation.",
  "frontend/src/hooks/useShopperApplication.ts": "Provides hooks to fetch and submit personal shopper applications, including status checks and application creation with image upload support.",
  "frontend/src/hooks/useShopperOrders.ts": "Manages shopper-specific order operations including listing eligible/assigned orders, viewing order details, and accepting/completing orders with 10-second polling.",
  "frontend/src/hooks/useSystemSettings.ts": "Defines a system wipe mutation hook that clears all cached queries; backend implementation is not yet complete.",
  "frontend/src/hooks/useTownMembership.ts": "Manages user's default town selection and provides placeholder hooks for future favorite towns functionality using the user profile backend.",
  "frontend/src/hooks/useTowns.ts": "Provides React Query hooks for town CRUD operations including listing all/active towns, creating, updating, and removing towns.",
  "frontend/src/hooks/useUserProfiles.ts": "Exports hooks for fetching and saving user profiles, including caller's profile with defaultTown support and specific user profile lookup.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom warm earth-tone color palette for light and dark modes using CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/admin/AdminDriversPage.tsx": "Admin page for managing driver applications with tabs for pending, approved, and rejected drivers. Provides functionality to view details, approve, or reject applications with reasons.",
  "frontend/src/pages/admin/AdminManageListingsPage.tsx": "Admin page for managing product listings that link products to retailers with prices. Supports creating, editing, deleting listings with search/filter functionality and status badges.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing and managing all orders with status filtering. Allows updating order status including assigning shoppers/drivers and tracking order lifecycle from pending to delivered.",
  "frontend/src/pages/admin/AdminPickupPointsPage.tsx": "Admin page for managing pickup point applications with tabs for pending, approved, and rejected applications. Provides approval/rejection functionality with town name resolution.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page for managing the global product catalogue with search functionality. Allows creating and editing products that become visible to customers once linked to retailers via listings.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "Admin page for managing retailers with search, create, edit, and delete functionality. Displays retailers in a table with location details and allows linking retailers to product listings.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin settings page with placeholder for general system configuration and a danger zone section containing the DangerZoneWipeSystemCard component for destructive operations.",
  "frontend/src/pages/admin/AdminShoppersPage.tsx": "Admin page for reviewing personal shopper applications with tabs for pending, approved, and rejected applications. Allows viewing details, approving, and rejecting applications with reasons.",
  "frontend/src/pages/admin/AdminTownApplicationsPage.tsx": "Deprecated admin page that displays an informational message explaining that town membership applications are no longer required as users can now freely manage their favorite towns.",
  "frontend/src/pages/admin/AdminTownsPage.tsx": "Admin page for managing towns with create, edit, and remove functionality. Features tabs for active and removed towns, form with searchable province selector, and displays town statistics.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Main admin dashboard with navigation cards for managing shoppers, drivers, pickup points, retailers, products, towns, and system settings. Each card links to its respective management page.",
  "frontend/src/pages/shop/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, remove buttons, and order summary. Shows empty state when cart is empty and allows proceeding to checkout.",
  "frontend/src/pages/shop/CataloguePage.tsx": "Displays a searchable product catalogue with filtering, product cards showing listings from multiple retailers, and add-to-cart functionality with stock and pricing information.",
  "frontend/src/pages/shop/CheckoutPage.tsx": "Handles order checkout flow with delivery method selection (home/pickup point), payment type selection (ZAR/ICP/NomaYini), and order submission with cart clearing and success confirmation.",
  "frontend/src/pages/shop/DriverApplicationPage.tsx": "Form for submitting driver applications with personal details, vehicle information, and selfie upload; checks for existing applications and handles image validation and file conversion.",
  "frontend/src/pages/shop/DriverDashboardPage.tsx": "Dashboard for drivers showing eligible orders ready for delivery in their town, with order details table including status badges, item counts, totals, and safe formatting for all order fields.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Landing page for joining the platform with three role options (Delivery Driver, Personal Shopper, Pickup Point), each with benefits listed and navigation to respective application forms.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Empty file placeholder for master admin role applications management page.",
  "frontend/src/pages/shop/MyOrdersPage.tsx": "Displays customer's order history in a table with order details, status badges, pickup point indicators, and navigation to order detail pages; includes loading and error states.",
  "frontend/src/pages/shop/MyTownsPage.tsx": "Page for users to view and change their default town for shopping and deliveries, with a searchable dropdown of active towns and display of current default town.",
  "frontend/src/pages/shop/OrderDetailPage.tsx": "Displays detailed information about a specific order including status, items, delivery method, payment method, and pickup point details if applicable.",
  "frontend/src/pages/shop/PickupPointApplicationPage.tsx": "Form page for users to submit pickup point applications with business details, address, contact info, town selection, and business image upload with progress tracking.",
  "frontend/src/pages/shop/PickupPointDashboardPage.tsx": "Dashboard for pickup point operators to view their orders and initiate walk-in customer orders, displaying a table of all orders with status badges.",
  "frontend/src/pages/shop/PickupPointShopCartPage.tsx": "Shopping cart page for pickup point operators creating orders for walk-in customers, with quantity controls, item removal, and order summary.",
  "frontend/src/pages/shop/PickupPointShopCataloguePage.tsx": "Displays a searchable product catalogue for pickup point staff to create orders on behalf of walk-in customers, with add-to-cart functionality and navigation to cart/checkout.",
  "frontend/src/pages/shop/PickupPointShopCheckoutPage.tsx": "Checkout page for pickup point staff to complete customer orders by collecting customer details (name, phone, address), selecting payment method (ZAR/ICP/Nomayini), and submitting the order.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Empty file with no content.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Landing page showcasing the Thuma Thina platform with hero section, feature cards for personal shoppers/delivery/pickup points, and community-driven shopping messaging.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Empty file with no content.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Empty file with no content.",
  "frontend/src/pages/shop/RetailerDashboardPage.tsx": "Dashboard for retailers showing store information, inventory statistics, and a table of product listings with stock levels, prices, and status badges.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Empty file with no content.",
  "frontend/src/pages/shop/RetailerOrderTrackingPage.tsx": "Order tracking page for retailers to view all orders containing their products, displaying order ID, creation date, total amount, status, and last update time.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Displays the status of user's role applications (shopper, pickup point, driver) with badges and alerts for pending, approved, or rejected states, including rejection reasons and application details.",
  "frontend/src/pages/shop/ShopperApplicationPage.tsx": "Form page for submitting a personal shopper application with name, email, phone, and selfie image upload, including file validation and upload progress tracking.",
  "frontend/src/pages/shop/ShopperDashboardPage.tsx": "Dashboard for approved shoppers to view available orders in their town, accept orders, and mark them as complete, with order details dialog.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Empty file with no content.",
  "frontend/src/router/HashRouter.tsx": "Defines the application's routing structure using TanStack Router with protected routes for authenticated users, role-specific dashboards (shopper, driver, pickup point, retailer, admin), and public shopping pages.",
  "frontend/src/utils/externalBlobUrl.ts": "Utility function to safely extract a displayable URL from an ExternalBlob instance, returning empty string on error.",
  "frontend/src/utils/fileBytes.ts": "Provides functions to convert File objects to Uint8Array and validate image files by type and size (default max 5MB).",
  "frontend/src/utils/money.ts": "Utility functions for formatting, parsing, and validating South African Rand (ZAR) amounts stored as bigint values.",
  "frontend/src/utils/productImages.ts": "Helper functions for managing product images: getting primary/all images (max 3), extracting URLs from ExternalBlob, and checking available image slots.",
  "frontend/src/utils/publicAssetUrl.ts": "Constructs deployment-safe URLs for static assets using Vite's BASE_URL to work in both development and production (ICP canister) environments.",
  "frontend/src/utils/saProvinces.ts": "Defines a constant array of South African province names and exports a TypeScript type for province values.",
  "frontend/src/utils/themeAssets.ts": "Centralized configuration for theme asset paths (logo, hero image) using deployment-safe URLs.",
  "frontend/src/utils/time.ts": "Utility functions to convert IC Time (bigint nanoseconds) to human-readable date and datetime strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both standard query strings and hash-based routing with persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and custom shadows with Inter and Poppins fonts.",
  "project_state.json": "Project state tracking document showing work-in-progress to extend towns module UI from admin-only to all authenticated users, with backend integration planned as a separate future phase."
}