{
  "backend/main.mo": "Main backend actor defining all data types (Product, Listing, Retailer, Order, UserProfile, Applications, etc.) and implementing business logic for e-commerce platform with authorization, blob storage, and user approval mixins.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features related to mandatory default town selection in ProfileSetupDialog and DefaultTownSetupDialog with high confidence test coverage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and assets, describing the warm African-inspired theme, shop layout, catalog functionality, and role-based application flows.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Thuma Thina' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the application with GlobalErrorBoundary, ThemeProvider, CartProvider, HashRouter, and Toaster for notifications.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "Admin card component with confirmation dialog for wiping all system data, requiring 'WIPE' text confirmation, showing success state, and triggering logout/reload after completion.",
  "frontend/src/components/admin/ListingEditDialog.tsx": "Dialog component for creating/editing product listings with fields for retailer, product, price, stock, status, and optional promotional pricing with start/end dates using ZAR currency formatting.",
  "frontend/src/components/admin/ProductEditDialog.tsx": "Dialog component for creating and editing products with fields for name, description, category, and image upload. Includes category creation functionality and integrates with product and category mutation hooks.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Dialog component for creating and editing retailers with tabs for basic info (name, email, phone, address, province, town) and opening hours. Uses RetailerHoursEditor for managing weekly schedules and holiday overrides.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Editor component for managing retailer opening hours including weekly schedules (per weekday with open/close times) and holiday overrides. Handles time code conversion and provides UI for adding/removing hours.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Reusable searchable dropdown select component built with Popover and Command components. Provides filtering and selection from a list of options with keyboard navigation support.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Empty file, likely a placeholder for admin initialization logic.",
  "frontend/src/components/auth/AdminOnly.tsx": "Component that displays a warning alert indicating that admin functionality requires backend implementation. Acts as a placeholder for unimplemented admin features.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Full-screen loading overlay that displays during login and actor initialization. Tracks initialization state per principal to avoid showing overlay on subsequent operations.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that handles Internet Identity login/logout with loading states. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup requiring name, email, phone, and default town selection. Non-dismissible until profile is completed.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Route guard component that checks admin status and displays access denied message for non-admin users. Shows loading state during verification.",
  "frontend/src/components/auth/RequireApproved.tsx": "Guards content requiring user approval, allowing admins to bypass and showing an approval request UI for unapproved users with loading states and success feedback.",
  "frontend/src/components/auth/RequireApprovedDriver.tsx": "Guards driver-only content by checking driver application status, displaying appropriate UI for no application, pending, or rejected states, while allowing admins to bypass.",
  "frontend/src/components/auth/RequireApprovedPickupPoint.tsx": "Guards pickup point content by checking application status, showing appropriate messages for unapproved, pending, or rejected states, with admin bypass.",
  "frontend/src/components/auth/RequireApprovedShopper.tsx": "Guards personal shopper dashboard access by checking shopper application status, displaying status-specific messages and navigation options, with admin bypass.",
  "frontend/src/components/auth/RequireAuth.tsx": "Guards authenticated content by checking Internet Identity login status and displaying a login prompt card for unauthenticated users.",
  "frontend/src/components/brand/BrandImage.tsx": "Reusable image component with error handling that displays themed fallback placeholders (logo or hero style) when image loading fails.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "React error boundary that catches component errors, unhandled promise rejections, and runtime errors, displaying an error screen with reset capability.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "Full-screen error UI displaying error details with options to reload the page or return home, styled with destructive theme colors.",
  "frontend/src/components/shop/cart/CartProvider.tsx": "React context provider for shopping cart state management with localStorage persistence, supporting add/remove/update operations and total calculations.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Custom hook providing search, category filtering, and price sorting functionality for catalog items with memoized results.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Empty file with no content.",
  "frontend/src/components/shop/ShopFooter.tsx": "Footer component displaying copyright, current year, and a 'Built with caffeine.ai' attribution link with UTM tracking parameters.",
  "frontend/src/components/shop/ShopHeader.tsx": "Main navigation header component with mobile menu, cart badge, authentication status, and conditional navigation links based on user roles (admin, shopper, driver, pickup point).",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Empty file, likely a placeholder for a hero section component on the shop landing page.",
  "frontend/src/components/shop/ShopLayout.tsx": "Layout wrapper component that includes header, footer, authentication overlay, and conditional dialogs for profile setup and default town selection based on user authentication and profile state.",
  "frontend/src/components/towns/DefaultTownSetupDialog.tsx": "Modal dialog that forces authenticated users without a default town to select one from active towns, with non-dismissible behavior.",
  "frontend/src/hooks/useActor.ts": "Hook managing the backend actor instance with authentication, automatically recreating the actor when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAdminOrders.ts": "React Query hooks for admin order management, providing functions to list all orders and update order status with automatic cache invalidation.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Empty file, likely a placeholder for admin bootstrapping functionality.",
  "frontend/src/hooks/useCatalog.ts": "React Query hook for fetching the global product catalog from the backend actor.",
  "frontend/src/hooks/useCategories.ts": "Hooks for category management with a predefined list of frequent categories merged with backend categories, plus mutation for creating new categories.",
  "frontend/src/hooks/useDriverApplication.ts": "React Query hooks for driver application management, including fetching application status and submitting new applications with KYC documents.",
  "frontend/src/hooks/useDriverOrders.ts": "Hook for fetching eligible driver orders with 10-second polling interval for real-time updates.",
  "frontend/src/hooks/useEnsureDefaultTownOsizweni.ts": "Hook that would automatically assign 'Osizweni' as the default town for authenticated users, but is currently disabled because town management backend methods are not yet implemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useListings.ts": "React Query hooks for managing product listings (CRUD operations), including filtering by retailer/product, setting promos, and invalidating related caches for products, retailers, and catalog.",
  "frontend/src/hooks/useNomaYini.ts": "Empty file with no content.",
  "frontend/src/hooks/useOrders.ts": "React Query hooks for order management, including fetching customer orders, creating orders with delivery methods (home/pickup point) and payment methods (ZAR/ICP/nomayini).",
  "frontend/src/hooks/usePickupPointApplication.ts": "React Query hooks for managing pickup point applications, including fetching application status, submitting new applications with business details and images, and checking approval status.",
  "frontend/src/hooks/usePickupPointOrders.ts": "React Query hooks for creating and listing pickup orders associated with a pickup point, with cache invalidation for orders and catalog.",
  "frontend/src/hooks/useProducts.ts": "React Query hooks for product CRUD operations, including listing all products, fetching individual products by ID, and creating/updating products with categories and images.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user approval management and admin checks, including requesting approval, listing all approvals, and setting approval status for users.",
  "frontend/src/hooks/useRetailerPortal.ts": "React Query hooks for retailer-specific data access, including fetching the authenticated user's retailer profile, inventory listings, and associated orders.",
  "frontend/src/hooks/useRetailers.ts": "Provides React Query hooks for CRUD operations on retailers (list, get, create, update, delete) with query key management and cache invalidation.",
  "frontend/src/hooks/useRoleApplications.ts": "Manages role application workflows for personal shoppers, pickup points, and drivers, including listing pending applications and approve/reject mutations with cache invalidation.",
  "frontend/src/hooks/useShopperApplication.ts": "Handles personal shopper application queries and mutations, including fetching application status, submitting new applications with selfie images, and invalidating related caches.",
  "frontend/src/hooks/useShopperOrders.ts": "Provides hooks for personal shoppers to view eligible and assigned orders, accept orders, and mark them complete, with 10-second polling for real-time updates.",
  "frontend/src/hooks/useSystemSettings.ts": "Defines a system wipe mutation hook that clears all cached queries; backend implementation is pending.",
  "frontend/src/hooks/useTownMembership.ts": "Provides hooks for managing user town memberships (default and additional towns) with add/remove favorite functionality; all backend methods are not yet implemented.",
  "frontend/src/hooks/useTowns.ts": "Manages town CRUD operations including listing all/active towns, creating, updating, and removing towns with query cache invalidation.",
  "frontend/src/hooks/useUserProfiles.ts": "Provides hooks to fetch and save user profiles for the caller or specific users, with Principal-based query keys and cache management.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark theme color schemes using warm earth tones (greens, yellows, terracotta).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/admin/AdminDriversPage.tsx": "Admin page for managing driver applications with tabs for pending, approved, and rejected drivers. Includes dialogs for viewing application details, approving drivers, and rejecting with reasons.",
  "frontend/src/pages/admin/AdminManageListingsPage.tsx": "Admin page for managing product listings that link products to retailers with prices. Provides search, create, edit, and delete functionality with status badges (active, out of stock, discontinued).",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing and managing all orders with status filtering and update capabilities. Allows admins to change order status and assign shoppers/drivers by principal ID.",
  "frontend/src/pages/admin/AdminPickupPointsPage.tsx": "Admin page for managing pickup point applications with tabs for pending, approved, and rejected applications. Includes approval/rejection workflows with town name resolution.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page for managing the global product catalogue with search, create, and edit functionality. Products become visible to customers once linked to retailers via listings.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "Admin page for managing retailers with search, create, edit, and delete functionality. Displays retailers in a table with location details and allows linking retailers to product listings.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin settings page with general configuration placeholder and a danger zone section containing the DangerZoneWipeSystemCard component for system-wide administrative actions.",
  "frontend/src/pages/admin/AdminShoppersPage.tsx": "Admin page for reviewing personal shopper applications with tabs for pending, approved, and rejected statuses. Allows approving or rejecting applications with reasons and displays applicant details including ID documents.",
  "frontend/src/pages/admin/AdminTownApplicationsPage.tsx": "Deprecated admin page that previously handled town membership applications. Now displays an informational message that users can freely manage favorite towns without admin approval.",
  "frontend/src/pages/admin/AdminTownsPage.tsx": "Admin page for managing towns with create, edit, and remove functionality. Features tabs for active and removed towns, province selection from SA_PROVINCES, and displays town statistics.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Main admin dashboard with navigation cards for managing shoppers, drivers, pickup points, retailers, products, towns, and system settings. Displays status badges and provides quick access to all admin sections.",
  "frontend/src/pages/shop/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, price calculations, and remove functionality. Shows empty state when cart is empty and provides checkout navigation.",
  "frontend/src/pages/shop/CataloguePage.tsx": "Displays a searchable product catalogue with filtering, showing products from multiple retailers with their listings, prices, and stock availability. Allows users to add items to cart from available listings.",
  "frontend/src/pages/shop/CheckoutPage.tsx": "Handles order checkout flow with delivery method selection (home/pickup point), payment type selection (ZAR/ICP/NomaYini), and order submission. Shows success state after order creation.",
  "frontend/src/pages/shop/DriverApplicationPage.tsx": "Driver application form that collects name, email, phone, vehicle details, and selfie image upload. Validates inputs and prevents duplicate applications.",
  "frontend/src/pages/shop/DriverDashboardPage.tsx": "Dashboard for drivers showing eligible orders ready for delivery in their town. Displays order details in a table with status badges and safe formatting for all fields.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Landing page for joining the platform with three role options: Delivery Driver, Personal Shopper, and Pickup Point. Links to respective application forms and application status page.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Empty file placeholder for master admin role applications management page.",
  "frontend/src/pages/shop/MyOrdersPage.tsx": "Displays customer's order history in a table with order details, status badges, and pickup point indicators. Includes loading states and error handling.",
  "frontend/src/pages/shop/MyTownsPage.tsx": "Page for managing user's favorite towns, displaying default town and allowing addition/removal of additional towns for shopping. Uses town membership hooks and searchable select for town selection.",
  "frontend/src/pages/shop/OrderDetailPage.tsx": "Displays detailed information for a specific order including status, items, delivery method, payment method, and pickup point details if applicable. Includes status badges and formatted display of order data.",
  "frontend/src/pages/shop/PickupPointApplicationPage.tsx": "Form page for submitting pickup point applications with business name, address, contact number, town selection, and business image upload. Handles file validation, upload progress tracking, and submission.",
  "frontend/src/pages/shop/PickupPointDashboardPage.tsx": "Dashboard for pickup point operators showing walk-in customer orders with a table view and button to start new walk-in orders. Displays order status badges and navigation to order details.",
  "frontend/src/pages/shop/PickupPointShopCartPage.tsx": "Shopping cart page for pickup point walk-in customer orders, allowing quantity adjustments and item removal. Shows empty state when cart is empty and provides navigation back to shopping or dashboard.",
  "frontend/src/pages/shop/PickupPointShopCataloguePage.tsx": "Displays a searchable product catalogue for pickup point staff to create orders on behalf of walk-in customers, with add-to-cart functionality and navigation to cart/checkout.",
  "frontend/src/pages/shop/PickupPointShopCheckoutPage.tsx": "Checkout page for pickup point staff to complete customer orders, collecting customer details (name, phone, address) and payment method before submitting the order.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Empty file with no content.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Landing page showcasing the Thuma Thina platform with hero section, feature cards explaining personal shoppers/delivery/pickup points, and call-to-action for authenticated users.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Empty file with no content.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Empty file with no content.",
  "frontend/src/pages/shop/RetailerDashboardPage.tsx": "Dashboard for retailers showing store information, inventory statistics, and a table of product listings with stock levels, prices, and status badges.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Empty file with no content.",
  "frontend/src/pages/shop/RetailerOrderTrackingPage.tsx": "Order tracking page for retailers to view all orders containing their products, displaying order ID, creation date, total amount, status, and last update time.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Displays the status of user's role applications (shopper, pickup point, driver) with badges and alerts for pending, approved, or rejected states, including application details and rejection reasons.",
  "frontend/src/pages/shop/ShopperApplicationPage.tsx": "Form page for submitting personal shopper applications with name, email, phone, and selfie image upload, including file validation and upload progress tracking.",
  "frontend/src/pages/shop/ShopperDashboardPage.tsx": "Dashboard for approved shoppers to view available orders, accept them, and mark them as complete, with order details dialog and status badges.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Empty file with no content.",
  "frontend/src/router/HashRouter.tsx": "Defines TanStack Router configuration with all application routes, including public pages, authenticated routes, and role-specific dashboards with auth guards.",
  "frontend/src/utils/externalBlobUrl.ts": "Utility function to safely extract displayable URLs from ExternalBlob instances with error handling.",
  "frontend/src/utils/fileBytes.ts": "Utilities for converting File objects to Uint8Array and validating image files by type and size (default 5MB max).",
  "frontend/src/utils/money.ts": "ZAR (South African Rand) formatting and parsing utilities for converting between bigint rands and display strings with validation.",
  "frontend/src/utils/productImages.ts": "Utilities for managing product images including getting primary/all images (max 3), extracting URLs from ExternalBlobs, and checking available image slots.",
  "frontend/src/utils/publicAssetUrl.ts": "Constructs deployment-safe URLs for static assets using Vite's BASE_URL to support both dev and production (ICP canister) environments.",
  "frontend/src/utils/saProvinces.ts": "Defines constant array of 9 South African provinces with TypeScript type export.",
  "frontend/src/utils/themeAssets.ts": "Centralized theme asset paths for Thuma Thina logo and hero images using deployment-safe URLs.",
  "frontend/src/utils/time.ts": "Utilities for converting IC Time (bigint nanoseconds) to human-readable date and datetime strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, animations, and design tokens for a component library.",
  "project_state.json": "Project state tracking document for \"Thuma Thina\" app, documenting the requirement for users to set a default town before accessing the app, with modal prompts and authentication flow checks."
}