{
  "backend/main.mo": "Motoko canister defining provinces, retailers, products, and product requests with CRUD-style methods for adding and querying data.",
  "feature_evidence.json": "Feature evidence metadata mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten collection of short summaries for key frontend files, describing their roles in layout, pages, hooks, and assets.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens and light/dark theme variables for the app.",
  "frontend/index.html": "Basic HTML entry point containing the root div and script loader for the React app.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and React Query provider for all shop pages.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "React hook handling search, category filtering, and price sorting for product lists.",
  "frontend/src/components/shop/ShopFooter.tsx": "Footer component showing attribution text and links styled with theme colors.",
  "frontend/src/components/shop/ShopHeader.tsx": "Header with logo, slogan, and navigation buttons for shop and request pages.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Hero section for the landing page with branding text and a themed illustration.",
  "frontend/src/components/shop/ShopLayout.tsx": "Layout wrapper combining header, main content region, and footer for shop pages.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and offering login and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for provinces, retailers, product catalogs, and submitting new product requests via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind and theme variables for light and dark modes with custom colors and base styles.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Displays product details by retailer and product ID, with loading states and navigation back to the catalog.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Shows a list of provinces fetched from the backend with loading and error states, allowing navigation to a province page.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Provides a form for users to request new products or retailers, including validation, submission, and success feedback.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Displays a retailer’s product catalog with search, category filters, sorting, and navigation to product detail pages.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Shows retailers for a selected town/suburb with loading/error states and navigation to retailer detail pages.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Lists towns/suburbs for a chosen province and navigates to their retailer listings.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project state, implemented features, and pending feature requests for the Shop-only MVP."
}