{
  "backend/main.mo": "Defines core backend actor types for products, retailers, listings, orders, applications, and related domain structures.",
  "feature_evidence.json": "Feature evidence report specifying files, components, and tests related to fully reverting the project to Version 34.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files, components, pages, hooks, and assets.",
  "frontend/index.css": "Tailwind base layer defining custom OKLCH theme variables for light and dark mode with global styling.",
  "frontend/index.html": "HTML entry file mounting the root element and loading the main client script.",
  "frontend/src/App.tsx": "App root that wraps the router with theme, error boundary, cart provider, and global Toaster UI.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "Admin card enabling full system wipe with confirmation dialog, success state, and logout‑and‑reload flow.",
  "frontend/src/components/admin/ListingEditDialog.tsx": "Dialog for creating or editing listings with product, retailer, price, stock, and promo configuration fields.",
  "frontend/src/components/admin/ProductEditDialog.tsx": "Dialog component for creating or updating products, handling fields, image upload, categories, and form submission.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Dialog for creating or editing retailers, managing contact info, address, hours, and submitting retailer data.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Editor for weekly and holiday opening hours, providing controls to toggle days, set times, and manage overrides.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Reusable searchable dropdown select component using popover and command UI elements.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Empty placeholder file for admin bootstrap logic.",
  "frontend/src/components/auth/AdminOnly.tsx": "Displays an alert stating admin features are unavailable due to missing backend implementation.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Shows a blocking loading overlay during authentication or initial actor setup for the current identity.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and clearing query state on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog that collects and submits user profile information with validation and error handling.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Wrapper that checks admin status and either renders children or shows an access‑denied message.",
  "frontend/src/components/auth/RequireApproved.tsx": "Checks if the user is approved or an admin; if not, shows an approval request UI before granting access.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content and prompts the user to log in when no identity is detected.",
  "frontend/src/components/brand/BrandImage.tsx": "Displays an image with fallback logo or hero placeholders when loading fails.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "Global React error boundary capturing runtime and promise errors and showing a fallback screen.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "Renders an error screen with details and actions to reload or return home.",
  "frontend/src/components/shop/cart/CartProvider.tsx": "Cart context managing items with add, remove, update, persistence, and total calculations.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Hook providing search, category filtering, sorting, and derived product lists for catalog items.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Empty file placeholder for catalogue preview section.",
  "frontend/src/components/shop/ShopFooter.tsx": "Footer showing copyright info and a link to caffeine.ai with dynamic year.",
  "frontend/src/components/shop/ShopHeader.tsx": "Header with navigation, cart badge, login button, mobile menu, and brand image.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Empty file placeholder for the shop landing hero section.",
  "frontend/src/components/shop/ShopLayout.tsx": "Main shop layout with header, footer, and dialogs for auth initialization, town setup, and profile setup.",
  "frontend/src/components/towns/DefaultTownSetupDialog.tsx": "Dialog prompting users to select and save a default town with loading and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminOrders.ts": "Provides admin hooks for listing all orders and updating order statuses with automatic query invalidation.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Empty file.",
  "frontend/src/hooks/useCatalog.ts": "Fetches the global product catalogue from the backend via the actor.",
  "frontend/src/hooks/useCategories.ts": "Lists categories by merging backend and predefined lists and provides mutation for creating new categories.",
  "frontend/src/hooks/useDriverApplication.ts": "Fetches or submits a driver's application and manages related query updates.",
  "frontend/src/hooks/useEnsureDefaultTownOsizweni.ts": "Placeholder hook meant to auto-assign a default town but currently disabled.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity login, identity loading, and authentication state management.",
  "frontend/src/hooks/useListings.ts": "Provides listing queries and mutations including create, update, delete, and retailer/product filtered listings.",
  "frontend/src/hooks/useNomaYini.ts": "Empty file.",
  "frontend/src/hooks/useOrders.ts": "Manages customer orders, including listing, fetching, and creating orders with delivery and payment handling.",
  "frontend/src/hooks/usePickupPointApplication.ts": "Manages pickup point application retrieval, status, and submission with query invalidation.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for listing, retrieving, creating, and updating products with cache invalidation logic.",
  "frontend/src/hooks/useQueries.ts": "Implements approval-related queries and mutations, including checking caller approval and managing user approvals and admin status.",
  "frontend/src/hooks/useRetailerPortal.ts": "Adds hooks for fetching the current retailer, their inventory, and their orders from the backend.",
  "frontend/src/hooks/useRetailers.ts": "Defines hooks for listing, retrieving, creating, updating, and deleting retailers with React Query caching.",
  "frontend/src/hooks/useRoleApplications.ts": "Contains hooks to manage shopper, pickup point, and driver role applications with approval and rejection mutations.",
  "frontend/src/hooks/useShopperApplication.ts": "Provides hooks for managing the caller’s personal shopper application, status, and submission.",
  "frontend/src/hooks/useSystemSettings.ts": "Adds a system wipe mutation placeholder that clears query cache but is not yet implemented in the backend.",
  "frontend/src/hooks/useTownMembership.ts": "Defines hooks for town membership queries and mutations, currently disabled pending backend support.",
  "frontend/src/hooks/useTowns.ts": "Provides placeholder hooks for town listing and management, all disabled until backend methods are implemented.",
  "frontend/src/hooks/useUserProfiles.ts": "Offers hooks to get and save user profiles, including caller profile and arbitrary user profiles for admins.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables with custom colors and a utility container class.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDriversPage.tsx": "Admin interface to review, approve, reject, and view details of driver applications.",
  "frontend/src/pages/admin/AdminManageListingsPage.tsx": "Admin page for listing management, including searching, editing, creating, and deleting product-retailer listings.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin dashboard for viewing all orders, filtering by status, and updating order states including assignments.",
  "frontend/src/pages/admin/AdminPickupPointsPage.tsx": "Admin interface for reviewing, approving, and rejecting pickup point applications.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product management page supporting search, creation, and editing of global catalogue products.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "Page for listing, searching, creating, editing, and deleting retailers using dialogs and API hooks.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "System settings page showing placeholder general settings and a danger zone wipe-system action.",
  "frontend/src/pages/admin/AdminShoppersPage.tsx": "Admin interface to review, approve, reject, and view details of personal shopper applications.",
  "frontend/src/pages/admin/AdminTownApplicationsPage.tsx": "Static page explaining town applications are no longer required and showing related info.",
  "frontend/src/pages/admin/AdminTownsPage.tsx": "Management page for creating, editing, filtering, and removing towns with form handling and tabs.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Admin dashboard linking to management pages for shoppers, drivers, pickup points, retailers, and products.",
  "frontend/src/pages/shop/CartPage.tsx": "Shopping cart page for viewing items, adjusting quantities, removing items, and checking out summary totals.",
  "frontend/src/pages/shop/CataloguePage.tsx": "Displays a searchable product catalogue, filters items, and allows adding orderable listings to the cart.",
  "frontend/src/pages/shop/CheckoutPage.tsx": "Handles order checkout including delivery method, payment selection, validation, and order submission.",
  "frontend/src/pages/shop/DriverApplicationPage.tsx": "Provides a form for drivers to submit applications with selfie upload, validation, and progress tracking.",
  "frontend/src/pages/shop/DriverDashboardPage.tsx": "Empty placeholder page for the driver dashboard.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Shows role options and navigation for applying as driver, shopper, or pickup point, plus application status.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Empty placeholder page for master admin role applications.",
  "frontend/src/pages/shop/MyOrdersPage.tsx": "Lists customer orders with status badges, loading states, and navigation to order details.",
  "frontend/src/pages/shop/MyTownsPage.tsx": "Allows users to view, add, and remove favorite towns with validation and town selection.",
  "frontend/src/pages/shop/OrderDetailPage.tsx": "Displays detailed order information, including status, delivery method, payment method, and skeleton loading states.",
  "frontend/src/pages/shop/PickupPointApplicationPage.tsx": "Provides a form for users to submit pickup point applications with image upload, validation, and progress tracking.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Empty file placeholder for a product detail page.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Landing-style page introducing the platform with hero content and feature cards.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Empty file placeholder for requesting new products.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Empty file placeholder for a retailer product catalog.",
  "frontend/src/pages/shop/RetailerDashboardPage.tsx": "Retailer dashboard showing retailer info, inventory stats, and listing statuses with error and loading states.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Empty file placeholder for a retailer list page.",
  "frontend/src/pages/shop/RetailerOrderTrackingPage.tsx": "Displays orders associated with a retailer, including status badges and a table view with error and loading handling.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Displays the user's shopper, pickup point, and driver application statuses with badges and messages.",
  "frontend/src/pages/shop/ShopperApplicationPage.tsx": "Form for submitting a shopper application, including selfie upload, validation, and progress tracking.",
  "frontend/src/pages/shop/ShopperDashboardPage.tsx": "Empty placeholder page for a future shopper dashboard.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Empty placeholder page for listing towns or suburbs.",
  "frontend/src/router/HashRouter.tsx": "Defines all hash-based routes for the shop, admin, and application pages using TanStack Router.",
  "frontend/src/utils/externalBlobUrl.ts": "Safely extracts a direct URL from an ExternalBlob, returning an empty string on failure.",
  "frontend/src/utils/fileBytes.ts": "Provides file-to-bytes conversion and basic image file validation by type and size.",
  "frontend/src/utils/money.ts": "Utility functions for formatting, parsing, and validating ZAR currency values.",
  "frontend/src/utils/productImages.ts": "Helpers for selecting primary product images, listing up to three images, and generating safe image URLs.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds deployment-safe URLs for public assets using Vite's base URL.",
  "frontend/src/utils/saProvinces.ts": "Exports a constant list of South African provinces and its type.",
  "frontend/src/utils/themeAssets.ts": "Defines theme asset URLs for the app’s logo and hero image using publicAssetUrl.",
  "frontend/src/utils/time.ts": "Formats IC nanosecond timestamps into readable date or date-time strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and cleaning URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, custom themes, typography, container queries, animations, and plugins.",
  "project_state.json": "Project metadata describing scope, architectural notes, known issues, and existing features for current development planning."
}