{
  "backend/main.mo": "Defines backend actor with types and state for retailers, products, listings, and access control, including admin bootstrap and auth checks. Core domain models and storage maps are initialized for retail operations.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing styling, routing, hooks, and feature‑related updates.",
  "frontend/index.css": "Defines Tailwind base layers and custom OKLCH color variables for light and dark mode themes.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up React Router routes and providers, defining all shop, admin, shopper, and driver dashboard routes.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "UI card enabling full system wipe with confirmation phrase, success state, and logout/reset flow.",
  "frontend/src/components/admin/ProductEditDialog.tsx": "Modal form for editing a product, handling validation, submission, and error display.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Admin dialog for editing retailer details including contact info and opening hours with backend-to-UI conversion.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Editor component for weekly operating hours and holiday overrides with add, update, and remove controls.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Searchable dropdown component using a popover and command list to filter and select options.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Invisible component that triggers admin bootstrap logic when identity changes.",
  "frontend/src/components/auth/AdminOnly.tsx": "Wrapper that restricts content to admins, showing authentication or permission errors when needed.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Overlay displayed during login or actor initialization showing loading status.",
  "frontend/src/components/brand/BrandImage.tsx": "Image component with fallback rendering for missing brand images, supporting logo or hero styles.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "Global error boundary catching runtime errors and unhandled rejections, rendering an error screen.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "Displays an error screen with details and actions to reload or return home.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Custom hook for filtering, searching, and sorting catalog items.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Shows featured product previews by fetching listings and product data, with navigation to product pages.",
  "frontend/src/components/shop/ShopFooter.tsx": "Renders the shop footer with branding, credits, and association info.",
  "frontend/src/components/shop/ShopHeader.tsx": "Provides the main shop header with branding, navigation, and authentication actions.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Displays the landing page hero section with branding, tagline, and hero image.",
  "frontend/src/components/shop/ShopLayout.tsx": "Wraps shop pages with header, footer, and auth initialization overlay.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Attempts one-time admin bootstrap using the current actor and updates related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data such as provinces, retailers, products, listings, and role applications.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for themes, including light and dark mode color palettes.",
  "frontend/src/main.tsx": "Initializes the React app root, wraps it with React Query and Internet Identity providers, and loads global styles.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "Admin UI for viewing, adding, editing, and deleting retailers, including schedules and holiday overrides.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Admin dashboard for managing products, listings, images, analytics, and system actions.",
  "frontend/src/pages/shop/DriverDashboardPage.tsx": "Driver interface for viewing, accepting, and completing delivery orders.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Displays role options for users and handles role application submissions with authentication checks.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Displays pending role applications and allows admins to approve or reject them with dialogs and mutation handlers.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Shows product details with images and retailer listings, handling loading, missing data, and navigation back to the catalog.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Lists provinces for browsing local retailers, includes loading/error states and a call-to-action to join the platform.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Provides a form for users to request new products or retailers with validation, submission, and success/error handling.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Displays a retailer’s product catalog with search, filtering, and sorting, enriching listings with product data from backend queries.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Displays retailers for a selected town/suburb with loading, error, and empty states, and navigates to retailer detail pages.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Shows the user's role applications with status badges, dates, and navigation, handling loading and error states.",
  "frontend/src/pages/shop/ShopperDashboardPage.tsx": "Provides a dashboard for shoppers to view and process placed orders, including accepting and marking orders done.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Lists towns/suburbs for a selected province with navigation and loading/empty handling.",
  "frontend/src/utils/money.ts": "Utility functions for formatting, parsing, and validating ZAR currency values.",
  "frontend/src/utils/productImages.ts": "Helpers for selecting primary product images, listing up to three images, generating URLs, and checking remaining image slots.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds safe URLs for static public assets using Vite's BASE_URL.",
  "frontend/src/utils/saProvinces.ts": "Exports a constant list of South African province names and a matching type.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including session storage support and hash routing handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and adding typography, container-queries, and animate plugins.",
  "project_state.json": "Project metadata describing marketplace app state, architecture notes, known issues, and existing/new feature requests."
}