{
  "backend/main.mo": "Defines core types and in‑memory state for retailers, products, listings, approvals, and admin authorization with functions for admin bootstrap, role management, and user approval.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and test IDs for build verification.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries of numerous frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base layer defining light/dark OKLCH color variables and applying global background and text styles.",
  "frontend/index.html": "Minimal HTML shell loading the React app entrypoint.",
  "frontend/src/App.tsx": "Sets up React Router routes, Internet Identity provider, query client, and admin-gated admin/retailers routes.",
  "frontend/src/components/admin/DangerZoneWipeSystemCard.tsx": "UI card enabling full system wipe with confirmation phrase, error handling, success state, and post-wipe logout flow.",
  "frontend/src/components/admin/RetailerEditDialog.tsx": "Dialog for editing retailer details and operating hours with validation and save handling.",
  "frontend/src/components/admin/RetailerHoursEditor.tsx": "Editor component for weekly hours and holiday overrides with add, update, and remove logic.",
  "frontend/src/components/admin/SearchableSelect.tsx": "Popover-based searchable select component using command palette interactions.",
  "frontend/src/components/auth/AdminBootstrapper.tsx": "Non-visual component triggering admin bootstrap logic when identity changes.",
  "frontend/src/components/auth/AdminOnly.tsx": "Wrapper that restricts content to authenticated admin users and shows appropriate warnings.",
  "frontend/src/components/auth/AuthInitializationOverlay.tsx": "Fullscreen overlay shown during login and actor initialization processes.",
  "frontend/src/components/brand/BrandImage.tsx": "Image component with graceful fallback rendering for failed logo or hero images.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "Global error boundary capturing runtime and unhandled promise errors and showing fallback UI.",
  "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx": "UI screen displaying unexpected runtime errors with options to reload or return home.",
  "frontend/src/components/shop/catalog/useCatalogControls.ts": "Offers search, category filtering, and sorting logic for catalog items.",
  "frontend/src/components/shop/CataloguePreviewSection.tsx": "Displays featured product previews by fetching listings and product details, showing a grid of clickable product cards.",
  "frontend/src/components/shop/ShopFooter.tsx": "Renders the shop footer with branding, credits, and association information.",
  "frontend/src/components/shop/ShopHeader.tsx": "Provides the main shop header with branding, navigation, authentication controls, and admin access.",
  "frontend/src/components/shop/ShopLandingHero.tsx": "Shows the landing hero section with branding, tagline, and a large hero image.",
  "frontend/src/components/shop/ShopLayout.tsx": "Wraps pages with header, footer, and auth initialization overlay in a full-page layout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Attempts admin bootstrap once per session and refreshes admin-related queries on success or failure.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing identity loading, login, logout, and status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as provinces, retailers, products, listings, and role applications.",
  "frontend/src/index.css": "Configures Tailwind layers and CSS variables for light and dark themes with custom colors and base styles.",
  "frontend/src/main.tsx": "Initializes the React app root, sets up React Query and Internet Identity providers, and loads global styles.",
  "frontend/src/pages/admin/AdminRetailersPage.tsx": "Admin interface for listing, adding, editing, and deleting retailers with form handling and dialogs.",
  "frontend/src/pages/shop/AdminDashboardPage.tsx": "Dashboard for admins to manage products, listings, images, and view analytics with multiple forms and tabs.",
  "frontend/src/pages/shop/JoinUsPage.tsx": "Displays available user roles and allows authenticated users to submit role applications except for Master Admin.",
  "frontend/src/pages/shop/MasterAdminRoleApplicationsPage.tsx": "Master admin page to review, approve, or reject pending role applications with confirmation dialogs.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Displays detailed product information with images and retailer listings, handling loading, not-found states, and navigation back to the retailer catalog.",
  "frontend/src/pages/shop/ProvinceListPage.tsx": "Shows a list of provinces for browsing local retailers, with loading, error, and empty states, plus a call‑to‑action section.",
  "frontend/src/pages/shop/RequestNewProductPage.tsx": "Provides a form for users to request new products or retailers, including validation, submission handling, and success/error feedback.",
  "frontend/src/pages/shop/RetailerCatalogPage.tsx": "Renders a retailer’s product catalog with search, filtering, sorting, and enriched product data fetched from additional queries.",
  "frontend/src/pages/shop/RetailerListPage.tsx": "Lists retailers within a selected town or suburb, handling navigation, loading, errors, and empty results.",
  "frontend/src/pages/shop/RoleApplicationsStatusPage.tsx": "Displays the user's role applications with status badges, loading/error states, and navigation back to the Join page.",
  "frontend/src/pages/shop/TownSuburbListPage.tsx": "Shows towns/suburbs for a selected province, handling loading and not-found states, and navigates to retailer browsing.",
  "frontend/src/utils/productImages.ts": "Provides helpers to select primary product images, assemble up to three images, generate image URLs, and check remaining image slots.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds safe public asset URLs using Vite's base path handling for dev and production environments.",
  "frontend/src/utils/saProvinces.ts": "Exports a constant list of South African provinces and its corresponding type.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and persisting URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, shadows, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "JSON record of the project's architecture, features, issues, and metadata for build planning and tracking."
}