{
  "kind": "build_request",
  "title": "Fix Internet Identity login blank screen after clicking Login",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-74",
      "text": "Fix the post-login blank-screen failure by ensuring the frontend actor initialization cannot be broken by access-control secret initialization when no admin token is provided (e.g., empty `caffeineAdminToken`). Specifically, make the backend access-control initialization path safe to call with empty tokens so the authenticated actor can still be created and used for normal browsing.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ok the log in worklow does not load after click log in, stuck with blank screen"
        ]
      },
      "acceptanceCriteria": [
        "Logging in with Internet Identity no longer results in a blank screen.",
        "After a successful login, the app continues rendering and users can navigate/browse as normal.",
        "If the frontend calls the access-control/secret initialization with empty token(s), the backend does not trap; the call succeeds or becomes a no-op that does not break the session."
      ]
    },
    {
      "id": "REQ-75",
      "text": "Add a user-visible, non-blank fallback UI for unexpected runtime errors during/after login (e.g., actor creation/query failures), so the app never renders a completely blank screen. The fallback must show an English error message and a recovery action (e.g., reload page / return home).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ok the log in worklow does not load after click log in, stuck with blank screen"
        ]
      },
      "acceptanceCriteria": [
        "If any unhandled error occurs during/after login, the UI shows a readable error panel instead of a blank page.",
        "The error panel includes English text describing that something went wrong during sign-in/loading and provides at least one recovery action (reload and/or navigate home).",
        "When no error occurs, the normal UI is unchanged."
      ]
    },
    {
      "id": "REQ-76",
      "text": "Ensure the login workflow provides a clear loading state during the Internet Identity round-trip and the immediate post-login initialization phase (without modifying any immutable hook files).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ok the log in worklow does not load after click log in, stuck with blank screen"
        ]
      },
      "acceptanceCriteria": [
        "After clicking “Login”, the user sees a visible loading state (not a blank screen) until the app is ready.",
        "If login fails, the app stays interactive and displays an English error message rather than going blank.",
        "This change does not modify any files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, or other immutable paths."
      ]
    }
  ],
  "constraints": [
    "Do not modify frontend immutable paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Backend must remain a single Motoko actor in `backend/main.mo`; only add `backend/migration.mo` changes if state migration is strictly required."
  ],
  "nonGoals": [
    "Implementing new auth providers or third-party authentication (only Internet Identity).",
    "Adding new product features unrelated to fixing the login blank-screen issue."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}