{
  "kind": "build_request",
  "title": "Add Admin Manage Listings dashboard (grouped by retailer) with create/edit/disable/delete",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the backend Listing model to include a listing creation timestamp so the admin UI can display a “listing date” for each listing.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "1 listing should show listing date price and inventory status"
        ]
      },
      "acceptanceCriteria": [
        "Backend Listing type includes a new createdAt field (Time.Time) that is set when a listing is created.",
        "Existing listing creation (addListing) persists createdAt for newly created listings.",
        "A state migration is added (backend/migration.mo, conditional) to populate createdAt for any existing persisted listings (use a sensible default such as the upgrade time or 0), and the canister upgrades without trapping."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend admin-only APIs to manage listings: update listing price/stock/status, and delete a listing.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "yes besides edit admin should be able to delete or disable(out of stock or emergency closure)",
          "i need a manage listing dashboard that has all listings per retailer."
        ]
      },
      "acceptanceCriteria": [
        "A shared admin-only method exists to update a listing by id, allowing price, stock, and status to be changed in one operation (and traps with clear messages on not-found/unauthorized).",
        "A shared admin-only method exists to delete a listing by id (and traps with clear messages on not-found/unauthorized).",
        "Listing management actions correctly persist to stable state and are reflected in subsequent queries (e.g., listListings)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create a new Admin “Manage Listings” page that shows all listings grouped by retailer, displaying listing date, price (ZAR), and inventory status, with actions to edit, disable, delete, and create a new listing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "so i need a manage listing dashboard that has all listings per retailer.",
          "1 listing should show listing date price and inventory status",
          "yes besides edit admin should be able to delete or disable(out of stock or emergency closure) admin can also create a new listing on this dashboard"
        ]
      },
      "acceptanceCriteria": [
        "A new route exists for the page (e.g., /admin/listings) and is wrapped with the existing <AdminOnly> protection.",
        "The page lists retailers, and within each retailer section lists that retailer’s listings.",
        "Each listing row shows: listing date (derived from createdAt), price formatted as ZAR, and inventory status (including stock quantity and the listing status).",
        "Each listing row provides actions: Edit (price/stock/status), Disable (sets status to out-of-stock/discontinued as appropriate), and Delete (with confirmation).",
        "The page provides a way to create a new listing (either an inline form or a clearly visible action that opens a form) using the existing retailer/product selectors and ZAR validation rules already used in admin listing creation.",
        "All user-facing text on this page is in English.",
        "After any mutation (create/update/status change/delete), the listings view refreshes via React Query cache invalidation so changes appear without a manual reload."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add/extend React Query hooks needed for listing management to support the Manage Listings page UI (fetch all listings and perform update/delete mutations).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "build now"
        ]
      },
      "acceptanceCriteria": [
        "A query hook exists to fetch all listings for admin usage (built on the existing backend listListings query).",
        "Mutation hooks exist for updating a listing and deleting a listing, calling the new backend methods from REQ-2.",
        "On success, hooks invalidate the relevant query keys so retailer/listing/product detail views remain consistent (at minimum: ['listings'], ['dashboardData'], and any listing-dependent keys already used in the app)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only as required for the Listing schema upgrade.",
    "Do not edit any files under frontend/src/components/ui or other frontend immutablePaths (compose existing UI components instead).",
    "Admin-only access control must be enforced server-side for all listing management mutations."
  ],
  "nonGoals": [
    "Do not add retailer self-service access or retailer-specific authentication/portals (system remains in-house admin managed).",
    "Do not implement new real-time updates (no websockets/push); rely on standard React Query refetch/invalidation.",
    "Do not change unrelated order workflow features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}