{
  "kind": "build_request",
  "title": "Add admin Retailers section with SA provinces, operating hours, edit/remove, and searchable dropdowns",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-87",
      "text": "Create a new admin-only “Retailers” management section (separate from the existing Admin Dashboard) dedicated to retailer registration and ongoing retailer management.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "lets do the retailers section first"
        ]
      },
      "acceptanceCriteria": [
        "A new admin-only route exists for retailer management (accessible only inside the existing <AdminOnly> gate).",
        "The new section supports registering a retailer and viewing/managing existing retailers in the same section.",
        "All user-facing text added for this section is in English."
      ]
    },
    {
      "id": "REQ-88",
      "text": "Implement a Retailers list in the new admin Retailers section that shows all retailers and provides actions to edit retailer details and remove retailers with a confirmation step.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "after adding retailer there should be a retailers list with option to edit of remove retailers."
        ]
      },
      "acceptanceCriteria": [
        "The UI displays a list/table of retailers loaded from live backend data.",
        "Each retailer row has an Edit action that updates retailer fields and persists changes.",
        "Each retailer row has a Remove action that asks for confirmation before deleting and then removes the retailer from backend state.",
        "After edit/remove, relevant React Query caches are invalidated/refreshed so the list updates without a full page reload."
      ]
    },
    {
      "id": "REQ-89",
      "text": "Add backend APIs to support retailer management: list all retailers, update an existing retailer, and remove an existing retailer; restrict all retailer mutation endpoints to admin callers.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "a new dedicated retailer section for registration and edit of retailers only."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method to return all retailers (not dependent on province/town iteration).",
        "Backend exposes admin-only methods to update a retailer and to remove a retailer.",
        "Unauthorized callers attempting update/remove retailer operations receive an authorization error (trap) consistent with existing admin checks."
      ]
    },
    {
      "id": "REQ-90",
      "text": "Add full per-day retailer operating hours (Mon–Sun) with additional holiday-specific overrides, store them on the retailer model, and make them editable from the admin Retailers section.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "full per day shedules including holidays and weekends individually"
        ]
      },
      "acceptanceCriteria": [
        "Retailer data includes a weekly schedule covering all seven days and a set of holiday overrides (date-specific).",
        "Admin UI can set each day as open or closed and, if open, configure opening and closing time fields.",
        "Admin UI can add/edit/remove holiday overrides per retailer.",
        "Saving operating hours persists to the backend and reloads correctly on page refresh."
      ]
    },
    {
      "id": "REQ-91",
      "text": "Prevent customers from placing orders while a retailer is closed by adding backend-level “retailer open” checks and frontend visibility of open/closed status on retailer browsing pages.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "include operating hours for retailers so that users cant make orders while retailers are closed."
        ]
      },
      "acceptanceCriteria": [
        "Backend provides a query that indicates whether a retailer is currently open based on stored weekly hours and holiday overrides.",
        "Backend exposes (or reuses) a reusable guard/check that can be applied to order-placement endpoints later (must be enforced server-side, not only in the UI).",
        "Retailer browsing UI clearly shows when a retailer is closed (English message) and does not present a path that implies an order can be placed while closed (e.g., disables or hides order initiation controls if present now or added later)."
      ]
    },
    {
      "id": "REQ-92",
      "text": "Replace free-text province entry during retailer registration with a dropdown containing all South African provinces (Eastern Cape, Free State, Gauteng, KwaZulu-Natal, Limpopo, Mpumalanga, Northern Cape, North West, Western Cape).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "provinces drop down appears when registering a retailer and choosing which location it is situated"
        ]
      },
      "acceptanceCriteria": [
        "Retailer registration UI uses a dropdown (not a free-text input) for province selection.",
        "The dropdown contains exactly the 9 South African provinces and saves the selected province string into the retailer record.",
        "All user-facing text for the dropdown and validation messages is English."
      ]
    },
    {
      "id": "REQ-93",
      "text": "Improve the admin listing creation UX by making the Retailer and Product selectors populated from live backend data and type-searchable (to avoid inefficient scrolling for long lists).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "lastly when listing an item make sure retailer and product drop down list is populated can be type searched for easier access we anticipate a long list and simply scrolling will not be efficient"
        ]
      },
      "acceptanceCriteria": [
        "In the existing listing creation form (Admin Dashboard), both Retailer and Product selectors load their options from live backend data.",
        "Both selectors support type-to-search filtering and keyboard navigation.",
        "Selecting a retailer/product reliably sets the IDs used in the listing creation mutation."
      ]
    },
    {
      "id": "REQ-94",
      "text": "Update backend state persistence safely to support the expanded retailer model (operating hours + holiday overrides) for existing canister state by adding/adjusting conditional migration logic.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "lets also include operating hours for retailers"
        ]
      },
      "acceptanceCriteria": [
        "An upgrade/migration path exists so existing retailer records are upgraded with default operating hours and no data loss of existing retailer fields (name, townSuburb, province).",
        "The app continues to load existing retailers after deployment/upgrade without trapping due to missing fields.",
        "Migration is implemented following the repo’s conditional migration policy (only create/update backend/migration.mo when needed)."
      ]
    }
  ],
  "constraints": [
    "Use English for all new user-facing text.",
    "Do not modify any files under frontend/src/components/ui (Shadcn components must be composed, not edited).",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo changes only if required for state upgrade."
  ],
  "nonGoals": [
    "Implementing Personal Shopper and Delivery Driver admin management sections (explicitly deferred until after the Retailers section).",
    "Implementing the full end-to-end customer order flow and payments (only add the retailer-closed gating primitives needed for later enforcement).",
    "Adding maps/geolocation or any third-party location services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}