{
  "kind": "build_request",
  "title": "Admin towns management module (CRUD) for curated towns list",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement persistent Towns data model and storage in the Motoko main actor, including an admin-curated list of towns with fields sufficient for admin management (at minimum: unique identifier, town name, province, created/updated timestamps, and a removal state that supports “remove towns” without breaking referential integrity later).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "add only towns management now",
          "the admin will populate a list of towns where we are acting and users choose from these towns"
        ]
      },
      "acceptanceCriteria": [
        "Towns are stored in canister state and persist across canister upgrades (no data loss on redeploy/upgrade).",
        "Each town has a stable unique identifier (not derived solely from name/province).",
        "Removing a town is supported in a way that allows it to be excluded from active lists while still being retained in state for future linking/audit use.",
        "Timestamps are set server-side."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend methods for towns management with admin-only authorization: list towns, create town, update town, and remove town. These methods must trap with a clear error when called by a non-admin.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "only the towns module for now, where admins can add, edit, and remove towns",
          "the admin will populate a list of towns"
        ]
      },
      "acceptanceCriteria": [
        "Non-admin callers cannot create/update/remove towns (calls trap/return error).",
        "Admin callers can create a town, see it in list results, update it, and remove it.",
        "List method returns a consistent shape used by the frontend (including removal state so UI can hide removed towns by default)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the existing React Query towns hooks (frontend/src/hooks/useTowns.ts) to call the new backend towns methods instead of placeholder implementations, including cache invalidation using the existing townKeys.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "add only towns management now",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "useListTowns returns backend data (not an empty array) when the actor is available.",
        "useCreateTown triggers backend create and invalidates towns queries on success.",
        "A new update-town mutation hook exists (or equivalent) and invalidates towns queries on success.",
        "useDeleteTown (or remove-town) triggers backend remove and invalidates towns queries on success."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add an Admin Towns management page (new React page component) that allows admins to: view the current towns list, add a town, edit a town, and remove a town, with basic validation (required name and province) and a confirmation step for removal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "only the towns module for now, where admins can add, edit, and remove towns",
          "the admin will populate a list of towns"
        ]
      },
      "acceptanceCriteria": [
        "The page is protected by the existing RequireAuth + RequireAdmin guards (non-admin cannot access).",
        "Admins can add a town via a form/dialog and see it appear in the list without a full page refresh.",
        "Admins can edit an existing town and see updated values reflected in the list.",
        "Admins can remove a town with a confirmation prompt; removed towns are not shown in the default active list view (unless an explicit ‘show removed’ toggle is provided).",
        "Errors from backend mutations are shown to the admin in clear English (toast or inline), and loading states are handled."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Expose navigation to the new Admin Towns page by adding an admin route in the hash router and linking to it from the admin area UI (e.g., from the existing Admin dashboard page).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "build towns management workflow for admins",
          "only the towns module for now"
        ]
      },
      "acceptanceCriteria": [
        "A new route exists (e.g., /admin/towns) and renders the Towns admin page inside ShopLayout.",
        "Admins can reach the Towns page from the existing /admin dashboard via a visible UI link/button.",
        "Navigating directly to the new route respects auth/admin guards (prompt login if not authenticated; block if not admin)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Apply a coherent, non-blue/non-purple visual treatment specifically for the Admin Towns page (layout, typography, spacing, and component styling) consistent with the existing app design system (shadcn + Tailwind), keeping user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "All labels, buttons, helper text, empty states, and error messages on the Towns admin page are in English.",
        "The page uses a consistent style (cards/tables/dialogs) aligned with existing UI components and does not introduce a conflicting color palette."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Only generate backend/migration.mo changes if required for preserving existing state during upgrade; follow the conditional migration policy.",
    "Do not edit files in frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui.",
    "Do not implement linking towns to retailers/shoppers/drivers/pickup points in this build; towns module only."
  ],
  "nonGoals": [
    "Building management modules for retailers, shoppers, drivers, or pickup points.",
    "Adding town selection to shopper/driver/retailer/pickup point creation flows.",
    "Implementing suburb-level management or geolocation/maps.",
    "Third-party authentication beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}