{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend wiring for Listings (promo) + Shopper Catalogue + Checkout order creation",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Wire listings hooks to backend capabilities and make the admin listings UI fully functional (list/create/edit/delete) with robust error handling.",
      "acceptanceCriteria": [
        "frontend/src/hooks/useListings.ts calls real actor methods for list/create/update/delete and no longer returns empty arrays or throws 'Backend method not yet implemented'.",
        "AdminManageListingsPage no longer shows the ‘backend not yet implemented’ warning once the backend is available, and it renders live listing data.",
        "Listing creation/edit flows succeed end-to-end and show toast errors for backend validation failures (e.g., duplicate retailer+product)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useListings.ts",
          "operation": "modify",
          "description": "Replace placeholder queries/mutations with real backend calls for listing management: listAllListings, getRetailerListings (for retailer filter), createListing, updateListing, deleteListing, and (when needed by UI) getListing. Ensure React Query keys remain stable and invalidate catalogue queries after mutations. Convert numeric filter inputs to bigint safely. Surface backend trap messages so admin UI can show a clear toast error (e.g., duplicate retailer+product). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminManageListingsPage.tsx",
          "operation": "modify",
          "description": "Remove/replace the 'backend not implemented' warning copy and render live listing data from useListListings. Add delete action wired to useDeleteListing with confirmation and toast feedback; keep edit/create flows using ListingEditDialog. Ensure this page continues to rely on the existing authorization component guard (RequireAdmin) already wired in the router; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Enhance the admin listing editor to configure promo pricing windows (including indefinite end) and show computed savings with validation.",
      "acceptanceCriteria": [
        "ListingEditDialog includes inputs for normal price and optional promo price.",
        "ListingEditDialog includes inputs for promo start and promo end, with a clear option to mark promo end as indefinite.",
        "When promo price is entered, the dialog displays computed savings (normal - promo) and prevents promo price >= normal price.",
        "Submitting the form sends promo fields to the backend update/create listing methods."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ListingEditDialog.tsx",
          "operation": "modify",
          "description": "Add promo UI controls: optional promo price, promo start date/time, optional promo end date/time, and an 'indefinite end' toggle. Show computed savings (normal - promo) when promo price is set, validate promoPrice < normalPrice, and validate date window inputs. On submit: create/update the base listing first, then setPromo/removePromo based on promo fields (using the backend capabilities), and show toast errors from backend validation. Keep using existing shadcn-ui form controls and dialog primitives; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useListings.ts",
          "operation": "modify",
          "description": "Extend listing mutations to support promo configuration from the editor by calling setPromo/removePromo as part of the create/update flow (or by exposing dedicated promo mutations consumed by ListingEditDialog). Ensure cache invalidation covers listings and catalogue so shopper pricing refreshes. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Wire the shopper catalogue page to the real backend global catalogue, add-to-cart using listingId, and display promo pricing + savings for promo-active listings.",
      "acceptanceCriteria": [
        "frontend/src/hooks/useCatalog.ts calls the real backend catalogue method and returns live data.",
        "CataloguePage ‘Add’ button adds the correct listingId to cart (so checkout references the listing, not the retailer).",
        "If a promo is active, the UI shows the promo price as the main price, shows the normal price as non-active (e.g., struck-through), and shows ‘You save R…’ based on the backend-provided prices.",
        "Listings that are not orderable are not shown, or (if present) are clearly disabled and cannot be added to cart."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCatalog.ts",
          "operation": "modify",
          "description": "Replace placeholder global catalogue query with a real call to the backend getCatalogue capability. Align hook types with backend.d.ts ShopProduct/ShopListing (activePrice, normalPrice, isPromoActive, savings, listingId, stock). Remove the local placeholder ShopProduct type and export the backend-aligned type for consumers. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/shop/CataloguePage.tsx",
          "operation": "modify",
          "description": "Render products from useGlobalCatalogue live data and show orderable listings using backend-provided listing fields (listingId, stock, activePrice, normalPrice, isPromoActive, savings). Update Add-to-cart to store listingId (not retailerId) and use activePrice for cart price. If promo is active, show promo price as main, normal price struck-through, and 'You save R…' using backend savings/derived value. Keep non-orderable listings hidden/disabled per backend rules (the backend should already exclude them; still defensively disable if stock==0). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/shop/cart/CartProvider.tsx",
          "operation": "modify",
          "description": "Ensure cart item shape supports listingId coming from bigint (stringified) and that add/update flows remain stable when listingId is no longer derived from retailerId. If needed, add minimal optional metadata fields for displaying promo/normal price without affecting persisted carts. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Wire checkout to backend order creation using cart listingIds + quantities, support pickupPoint delivery option, and show friendly validation errors.",
      "acceptanceCriteria": [
        "frontend/src/hooks/useOrders.ts implements createOrder by calling the backend and removes the placeholder 'Backend method not implemented' error.",
        "CheckoutPage submits an order request using listingIds from the cart and displays backend errors in a user-friendly way without crashing.",
        "On success, the cart is cleared and the existing success UI is shown.",
        "If an item is out of stock at submit time, the backend rejects the order and the frontend displays that error message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useOrders.ts",
          "operation": "modify",
          "description": "Implement createOrder mutation via backend createOrder capability: map cart items to (listingId, quantity) bigints; map delivery selection to DeliveryMethod variant (#home with address or #pickupPoint with pointId); map UI payment selection to PaymentMethod enum. Implement order queries using backend getMyOrders and getOrder so existing pages can load real order history and detail. Ensure errors from backend traps are propagated for user-friendly display. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/shop/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Update submit handler to build the backend-compatible order payload (listingIds + quantities from cart, delivery method including pickup point option, and payment method). Replace the 'backend not implemented' messaging with real pending/error UI: show backend validation errors (e.g., out-of-stock) in an alert/toast without crashing. Clear cart on successful order creation and keep existing success UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/shop/MyOrdersPage.tsx",
          "operation": "modify",
          "description": "Replace placeholder messaging with a real orders list view backed by useListOrdersByCustomer (getMyOrders). Render basic fields (id, status, createdAt, totalAmount) and link to OrderDetailPage route. Keep RequireAuth protections as already wired via the router. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/shop/OrderDetailPage.tsx",
          "operation": "modify",
          "description": "Replace placeholder detail card with real order detail rendering backed by useGetOrder (getOrder): show status, delivery method (home vs pickupPoint), payment method, totals, and line items (listingId + quantity). Use existing formatting helpers for dates and money. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}