{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Towns management (frontend hooks + admin page + routing)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Update towns React Query hooks to call backend towns management functions and invalidate caches via existing townKeys.",
      "acceptanceCriteria": [
        "useListTowns returns backend data (not an empty array) when the actor is available.",
        "useCreateTown triggers backend create and invalidates towns queries on success.",
        "A new update-town mutation hook exists (or equivalent) and invalidates towns queries on success.",
        "useDeleteTown (or remove-town) triggers backend remove and invalidates towns queries on success."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTowns.ts",
          "operation": "modify",
          "description": "Replace placeholder implementations with actor-backed calls to the backendInterface towns capabilities (listTowns/createTown/updateTown/removeTown), ensure hooks are gated by actor availability like other hooks, and add a dedicated update-town mutation hook. Keep cache invalidation using the existing townKeys (invalidate towns queries on mutation success)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Create an admin-only Towns management page to list, add, edit, and remove towns with validation, confirmation, and clear loading/error handling.",
      "acceptanceCriteria": [
        "The page is protected by the existing RequireAuth + RequireAdmin guards (non-admin cannot access).",
        "Admins can add a town via a form/dialog and see it appear in the list without a full page refresh.",
        "Admins can edit an existing town and see updated values reflected in the list.",
        "Admins can remove a town with a confirmation prompt; removed towns are not shown in the default active list view (unless an explicit ‘show removed’ toggle is provided).",
        "Errors from backend mutations are shown to the admin in clear English (toast or inline), and loading states are handled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminTownsPage.tsx",
          "operation": "create",
          "description": "Create the Admin Towns management page UI using the selected shadcn-ui component set (e.g., Card/Table/Dialog/AlertDialog/Input/Button/Badge/Switch) and Tailwind for layout. Verify the component's usage instructions before implementing. Use useListTowns/useCreateTown/useUpdateTown/useDeleteTown from frontend/src/hooks/useTowns.ts to support list/add/edit/remove. Include basic validation (required name and province), a removal confirmation step, and clear English error messaging (toast/inline) plus loading/empty states. Default to hiding removed towns with an explicit 'Show removed' toggle."
        },
        {
          "path": "frontend/src/components/admin/SearchableSelect.tsx",
          "operation": "modify",
          "description": "Extend the existing SearchableSelect to optionally support a simple, reusable value/label option list suitable for selecting a province from frontend/src/utils/saProvinces.ts (if current props are too restrictive). Keep it backward-compatible for any existing uses. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add /admin/towns route to the hash router and link to it from the Admin dashboard UI.",
      "acceptanceCriteria": [
        "A new route exists (e.g., /admin/towns) and renders the Towns admin page inside ShopLayout.",
        "Admins can reach the Towns page from the existing /admin dashboard via a visible UI link/button.",
        "Navigating directly to the new route respects auth/admin guards (prompt login if not authenticated; block if not admin)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/router/HashRouter.tsx",
          "operation": "modify",
          "description": "Register a new admin route (e.g., /admin/towns) that renders the new AdminTownsPage and is wrapped with the existing RequireAuth + RequireAdmin guards. Ensure it is rendered within ShopLayout (router already wraps renderRoute)."
        },
        {
          "path": "frontend/src/pages/shop/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a visible navigation control (button/link card) that routes admins to /admin/towns using the existing navigate helper, positioned consistently with the dashboard layout and using English text."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Apply a coherent non-blue/non-purple visual treatment for the Admin Towns page consistent with shadcn + Tailwind, with all user-facing text in English.",
      "acceptanceCriteria": [
        "All labels, buttons, helper text, empty states, and error messages on the Towns admin page are in English.",
        "The page uses a consistent style (cards/tables/dialogs) aligned with existing UI components and does not introduce a conflicting color palette."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminTownsPage.tsx",
          "operation": "modify",
          "description": "Refine Admin Towns page styling to use a neutral/earthy palette (avoid blue/purple accents), consistent spacing/typography, and shadcn patterns (cards, table rows, dialogs). Ensure all visible strings are in English, including validation messages, confirmations, empty states, and error messages. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}