{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enforce mandatory default town requirement for all users",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make default town field mandatory in ProfileSetupDialog and prevent dialog dismissal until town is selected",
      "acceptanceCriteria": [
        "ProfileSetupDialog cannot be dismissed or closed until a default town is selected",
        "Form validation prevents submission without a default town",
        "User cannot proceed to use the app without completing town selection"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Remove the onOpenChange prop from the Dialog component to prevent dismissal. Add form validation to require defaultTown selection before allowing form submission. Update the form state to include defaultTown as a required field with proper validation error messages. Ensure the submit button remains disabled until all required fields including defaultTown are filled."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Display DefaultTownSetupDialog immediately after login for users with profiles but no default town",
      "acceptanceCriteria": [
        "After successful login, check if user has a profile with no default town",
        "Show DefaultTownSetupDialog modal when user lacks a default town",
        "Modal cannot be dismissed until town is selected",
        "User cannot access any app features until town is set"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/shop/ShopLayout.tsx",
          "operation": "modify",
          "description": "Add logic to check if authenticated user has a profile with defaultTown === undefined or null. When this condition is met, render the DefaultTownSetupDialog as a blocking modal before showing other content. Ensure the dialog appears after ProfileSetupDialog completes (if needed) but before allowing access to the main app content. Update the existing conditional rendering logic to include this check."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update ShopLayout to render blocking DefaultTownSetupDialog for users with profiles but no default town",
      "acceptanceCriteria": [
        "DefaultTownSetupDialog appears as a blocking modal when user has profile but no default town",
        "Dialog cannot be dismissed or bypassed",
        "After town selection, dialog closes and user can access the app normally"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/towns/DefaultTownSetupDialog.tsx",
          "operation": "modify",
          "description": "Remove the onOpenChange prop from the Dialog component to prevent manual dismissal. Ensure the dialog can only be closed programmatically after successful town selection and profile update. Add proper error handling for the town selection and profile save operations. Make the close button (X) either hidden or non-functional to enforce mandatory completion."
        },
        {
          "path": "frontend/src/components/shop/ShopLayout.tsx",
          "operation": "modify",
          "description": "Refactor the conditional rendering logic to properly sequence ProfileSetupDialog and DefaultTownSetupDialog. Add state management to track when each dialog should be shown based on authentication state, profile existence, and defaultTown presence. Ensure DefaultTownSetupDialog blocks all underlying content when displayed and cannot be dismissed until a town is selected. Use the userProfile query data to determine if defaultTown is missing (undefined or null)."
        }
      ]
    }
  ]
}