{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Manage Listings dashboard (grouped by retailer) with create/edit/disable/delete",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Create an admin Manage Listings page (grouped by retailer) that displays listing date, ZAR price, inventory status, and supports create/edit/disable/delete with cache refresh.",
      "acceptanceCriteria": [
        "A new route exists for the page (e.g., /admin/listings) and is wrapped with the existing <AdminOnly> protection.",
        "The page lists retailers, and within each retailer section lists that retailer’s listings.",
        "Each listing row shows: listing date (derived from createdAt), price formatted as ZAR, and inventory status (including stock quantity and the listing status).",
        "Each listing row provides actions: Edit (price/stock/status), Disable (sets status to out-of-stock/discontinued as appropriate), and Delete (with confirmation).",
        "The page provides a way to create a new listing (either an inline form or a clearly visible action that opens a form) using the existing retailer/product selectors and ZAR validation rules already used in admin listing creation.",
        "All user-facing text on this page is in English.",
        "After any mutation (create/update/status change/delete), the listings view refreshes via React Query cache invalidation so changes appear without a manual reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminManageListingsPage.tsx",
          "operation": "create",
          "description": "Implement the Admin “Manage Listings” page UI grouped by retailer: fetch retailers + admin listings, render a retailer section with a table of listings showing listing date (from createdAt), price formatted via existing money utils, and inventory status (stock + ListingStatus). Provide actions per listing: Edit (open a dialog/form to change price/stock/status), Disable (set status to outOfStock or discontinued), and Delete (confirmation dialog). Include a Create Listing form (inline or dialog) that reuses the existing retailer/product selectors (SearchableSelect) and the existing ZAR validation/parsing rules (money utils). Use existing shadcn-ui building blocks (Card, Table, Button, Dialog/AlertDialog, Inputs) from the project to compose the UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new protected admin route for the Manage Listings page (e.g., /admin/listings) wrapped with the existing <AdminOnly> component, and wire it to render AdminManageListingsPage so it is reachable via navigation."
        },
        {
          "path": "frontend/src/pages/shop/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a clear navigation entry (e.g., a button) from the existing Admin Dashboard to the new Manage Listings page route so the page is discoverable and not orphaned. Use existing shadcn-ui Button styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/time.ts",
          "operation": "create",
          "description": "Add a small frontend time formatting utility to convert IC Time (bigint) into a human-readable English date string for the listing date column (derived from createdAt). Keep formatting consistent and locale-safe for English UI."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add/extend React Query hooks for admin listing management: fetch all listings and perform update/delete mutations with proper cache invalidation.",
      "acceptanceCriteria": [
        "A query hook exists to fetch all listings for admin usage (built on the existing backend listListings query).",
        "Mutation hooks exist for updating a listing and deleting a listing, calling the new backend methods from REQ-2.",
        "On success, hooks invalidate the relevant query keys so retailer/listing/product detail views remain consistent (at minimum: ['listings'], ['dashboardData'], and any listing-dependent keys already used in the app)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for admin listing management using the existing actor methods exposed in the frontend backend interface: (1) an admin listings query hook built on listListings, and (2) mutation hooks for adminUpdateListing and adminDeleteListing. Ensure onSuccess invalidates at minimum ['listings'] and ['dashboardData'], and also invalidates other listing-dependent keys already used (e.g., retailer/product detail keys such as ['retailers'], ['cataloguePreview'], and ['productWithRetailers'] where applicable) so UI refreshes without manual reload."
        },
        {
          "path": "frontend/src/pages/admin/AdminManageListingsPage.tsx",
          "operation": "modify",
          "description": "Wire the Manage Listings page to the new React Query hooks (admin listings query + update/delete mutations) and ensure user actions trigger the appropriate mutations and rely on cache invalidation for refresh. Use existing shadcn-ui components for dialogs and forms; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}