{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Prevent blank screen during/after Internet Identity login with loading + error fallback",
  "requirements": [
    {
      "id": "REQ-75",
      "summary": "Add a global, user-visible fallback UI for unexpected runtime errors during/after login so the app never renders blank.",
      "acceptanceCriteria": [
        "If any unhandled error occurs during/after login, the UI shows a readable error panel instead of a blank page.",
        "The error panel includes English text describing that something went wrong during sign-in/loading and provides at least one recovery action (reload and/or navigate home).",
        "When no error occurs, the normal UI is unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/errors/UnexpectedRuntimeErrorScreen.tsx",
          "operation": "create",
          "description": "Create a reusable error screen component that renders a clear English error message and provides recovery actions (at minimum: reload page and navigate home). Use shadcn-ui components (e.g., Button/Alert/Card if available) for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/errors/GlobalErrorBoundary.tsx",
          "operation": "create",
          "description": "Add a global error boundary that catches render-time exceptions and also captures window-level runtime errors (e.g., unhandled promise rejections) during/after login, and renders UnexpectedRuntimeErrorScreen instead of leaving the UI blank."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the RouterProvider (or the root route layout tree) with GlobalErrorBoundary so any unexpected runtime errors during/after login show the fallback UI rather than a blank screen. Ensure normal rendering is unchanged when no errors occur."
        }
      ]
    },
    {
      "id": "REQ-76",
      "summary": "Provide a clear, non-blank loading state during the Internet Identity round-trip and immediate post-login initialization, without modifying immutable hook files.",
      "acceptanceCriteria": [
        "After clicking “Login”, the user sees a visible loading state (not a blank screen) until the app is ready.",
        "If login fails, the app stays interactive and displays an English error message rather than going blank.",
        "This change does not modify any files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, or other immutable paths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AuthInitializationOverlay.tsx",
          "operation": "create",
          "description": "Create an overlay/loading component that becomes visible during Internet Identity login and the immediate post-login actor initialization phase by reading state from existing hooks (without modifying immutable hooks). Use shadcn-ui primitives (e.g., Button/Spinner styling patterns) where appropriate; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/shop/ShopLayout.tsx",
          "operation": "modify",
          "description": "Wire AuthInitializationOverlay into the main layout so it is always present and can display a visible loading state during login and post-login initialization without adding new routes/pages."
        },
        {
          "path": "frontend/src/components/shop/ShopHeader.tsx",
          "operation": "modify",
          "description": "Ensure the header login area remains clearly interactive during login failures by surfacing an English error message when Internet Identity reports a login error state (while keeping existing behavior unchanged when no error occurs). Use shadcn-ui components (e.g., Alert) for consistent UI; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}