{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Step 1: Pickup Point Dashboard placeholder page + authenticated route",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a placeholder Pickup Point Dashboard page component under shop pages with an H1 title and short description, and no data fetching.",
      "acceptanceCriteria": [
        "A new page component exists under frontend/src/pages/shop for the pickup-point dashboard.",
        "When rendered, the page shows a visible title (H1) and a short English placeholder description.",
        "The page does not import or call any data-fetching hooks (React Query) or actor methods.",
        "The page renders without runtime errors and uses existing layout conventions (e.g., container-custom + spacing) consistent with other shop pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/shop/PickupPointDashboardPage.tsx",
          "operation": "create",
          "description": "Create the PickupPointDashboardPage component rendering placeholder-only UI: a container-custom wrapper with existing spacing conventions (e.g., py-8 + space-y-*), a clear H1 title (\"Pickup Point Dashboard\") and a short English description indicating this is an upcoming dashboard. Do not import/use React Query hooks or actor calls. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Register a new /pickup-point-dashboard route in the TanStack HashRouter, protected by RequireAuth, rendering the new placeholder page.",
      "acceptanceCriteria": [
        "Navigating to /pickup-point-dashboard while logged out shows the existing login gate (RequireAuth behavior).",
        "Navigating to /pickup-point-dashboard while logged in renders the new placeholder pickup-point dashboard page.",
        "The new route is included in the router's routeTree so it is reachable at runtime.",
        "No other routes, dashboards, or role-approval guards are changed in this step."
      ],
      "file_operations": [
        {
          "path": "frontend/src/router/HashRouter.tsx",
          "operation": "modify",
          "description": "Add an import for PickupPointDashboardPage, define a new route at path '/pickup-point-dashboard' that renders the page inside RequireAuth (use the existing RequireAuth guard provided by the authorization setup; no additional approval/role gating in this step), and include the route in routeTree so it is reachable. Keep all other routes unchanged. (Verify the component's usage instructions before implementing.)"
        }
      ]
    }
  ]
}