{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build a listings module where an admin links registered retailers to products from a global admin-managed catalogue, sets retailer pricing (including promo pricing with savings display and start/end dates where end can be indefinite), and exposes only active, orderable listings to customers for checkout and pickup points.",
  "architectural_notes": [
    "Global product catalogue is an admin-managed list of products.",
    "Each retailer can have at most one normal price per product; optional promo price can override normal price when active.",
    "Promo pricing supports start/end dates; end date may be indefinite requiring manual deactivation.",
    "Customers should only see active listings; out-of-stock items must not be orderable."
  ],
  "known_issues": [
    "Automated build/deploy for the listings module failed when attempted; may need to split implementation into smaller steps to deploy cleanly."
  ],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-wire-the-frontend-listings-hooks-to-real-backend-methods-replace-placeholders-and-update-the-admin-listings-ui-to-fully-function-listings-list-create-edit-and-validation-error-handling-for-duplicate-retailer-product-listings-and-promo-fields",
      "title": "Wire the frontend listings hooks to real backend methods (replace placeholders) and update the admin listings UI to fully function: listings list, create, edit, and validation/error handling for duplicate retailer/product listings and promo fields.",
      "reqIds": [
        "REQ-12"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-admin-listing-editor-ui-to-support-promo-configuration-normal-price-optional-promo-price-promo-start-date-time-optional-indefinite-promo-end-date-time-and-display-of-calculated-savings-when-promo-price-is-set-normal-promo",
      "title": "Update the admin listing editor UI to support promo configuration: normal price, optional promo price, promo start date/time, optional/indefinite promo end date/time, and display of calculated savings when promo price is set (normal - promo).",
      "reqIds": [
        "REQ-13"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-shopper-catalogue-page-to-use-the-real-backend-global-catalogue-products-orderable-listings-correctly-add-items-to-cart-using-listingid-not-retailerid-and-display-promo-pricing-with-savings-when-applicable-while-keeping-non-orderable-listings-disabled-hidden-per-backend-rules",
      "title": "Update the shopper catalogue page to use the real backend global catalogue (products + orderable listings), correctly add items to cart using listingId (not retailerId), and display promo pricing with savings when applicable while keeping non-orderable listings disabled/hidden per backend rules.",
      "reqIds": [
        "REQ-14"
      ],
      "version": 1
    },
    {
      "id": "feature-wire-the-checkout-flow-to-real-backend-order-creation-and-ensure-the-order-payload-uses-cart-listingids-quantities-selected-delivery-method-including-pickup-point-option-and-payment-method-show-a-clear-user-facing-error-if-backend-validation-fails-e-g-item-became-out-of-stock",
      "title": "Wire the checkout flow to real backend order creation and ensure the order payload uses cart listingIds, quantities, selected delivery method (including pickup point option), and payment method; show a clear user-facing error if backend validation fails (e.g., item became out-of-stock).",
      "reqIds": [
        "REQ-15"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Listings module: admin links registered retailers to global catalogue products, sets one retailer price per product with optional promo pricing (normal visible but inactive; promo active) incl. savings display and promo start/end dates (end can be indefinite); only active, in-stock listings are visible/orderable by customers for checkout and pickup points.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Extend the backend listings domain model to support admin-managed retailer pricing with optional promo pricing, including: (a) one listing per (retailerId, productId), (b) normal price, (c) optional promo price, (d) promo start date, (e) promo end date that can be indefinite, and (f) logic to determine whether the promo price is currently active.",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Implement backend admin-only CRUD APIs for listings: create listing, update listing (including promo fields and status), delete listing, and list listings (all and by retailer/product filters as needed by the current frontend).",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Implement backend shopper-facing catalogue query API that returns the global catalogue augmented with retailer listings, exposing only listings that are orderable to customers (active and in-stock), and includes enough pricing data for the frontend to display the active price and the savings vs normal price when a promo is active.",
      "reqIds": [
        "REQ-9"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Implement backend order creation to support checkout for customers using listing IDs and quantities, validating that each requested listing is currently orderable (active and in-stock), computing total amount using the active price (promo if active), decrementing stock atomically, and storing the order record with delivery method supporting pickup points.",
      "reqIds": [
        "REQ-10"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Add a conditional Motoko state migration for the listings schema change so existing canister state can upgrade safely after introducing promo-related fields and any new indices required for uniqueness (retailerId, productId).",
      "reqIds": [
        "REQ-11"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Implement Listings Module with Promo Pricing, Active Catalogue, and Checkout Orderability",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}