{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Marketplace app with in-app admin console. Admin will manage global product catalogue (name, description, up to 3 images), manage retailers (business name, town, phone, email, operating hours, image), manage shop catalogue listings (link retailer to product with price, stock quantity, availability), approve shoppers/drivers/pickup points with document images, and use soft-delete so records are hidden from active lists but retained. Towns are admin-curated and users will choose from available towns; current build scope is towns management only.",
  "architectural_notes": [
    "Implement soft-delete/archive for users/retailers/shoppers/drivers/pickup points so deleted records are retained but hidden from active lists.",
    "Towns are a first-class entity managed by admin; other entities will reference a town for filtering/selection later."
  ],
  "known_issues": [
    "Automated build attempts for admin console/towns module repeatedly failed to complete; may require simplifying build scope or splitting backend/UI changes into smaller steps."
  ],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-update-the-existing-react-query-towns-hooks-frontend-src-hooks-usetowns-ts-to-call-the-new-backend-towns-methods-instead-of-placeholder-implementations-including-cache-invalidation-using-the-existing-townkeys",
      "title": "Update the existing React Query towns hooks (frontend/src/hooks/useTowns.ts) to call the new backend towns methods instead of placeholder implementations, including cache invalidation using the existing townKeys.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-add-an-admin-towns-management-page-new-react-page-component-that-allows-admins-to-view-the-current-towns-list-add-a-town-edit-a-town-and-remove-a-town-with-basic-validation-required-name-and-province-and-a-confirmation-step-for-removal",
      "title": "Add an Admin Towns management page (new React page component) that allows admins to: view the current towns list, add a town, edit a town, and remove a town, with basic validation (required name and province) and a confirmation step for removal.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-expose-navigation-to-the-new-admin-towns-page-by-adding-an-admin-route-in-the-hash-router-and-linking-to-it-from-the-admin-area-ui-e-g-from-the-existing-admin-dashboard-page",
      "title": "Expose navigation to the new Admin Towns page by adding an admin route in the hash router and linking to it from the admin area UI (e.g., from the existing Admin dashboard page).",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-apply-a-coherent-non-blue-non-purple-visual-treatment-specifically-for-the-admin-towns-page-layout-typography-spacing-and-component-styling-consistent-with-the-existing-app-design-system-shadcn-tailwind-keeping-user-facing-text-in-english",
      "title": "Apply a coherent, non-blue/non-purple visual treatment specifically for the Admin Towns page (layout, typography, spacing, and component styling) consistent with the existing app design system (shadcn + Tailwind), keeping user-facing text in English.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Admin towns management module (in-app): add/edit/remove towns; towns are an admin-curated list used elsewhere later",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Complete admin console in same app: manage global products, retailers, and retailer listings; approvals for shoppers/drivers/pickup points; view & soft-delete users/retailers/shoppers/drivers/pickup points",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Implement persistent Towns data model and storage in the Motoko main actor, including an admin-curated list of towns with fields sufficient for admin management (at minimum: unique identifier, town name, province, created/updated timestamps, and a removal state that supports “remove towns” without breaking referential integrity later).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Add backend methods for towns management with admin-only authorization: list towns, create town, update town, and remove town. These methods must trap with a clear error when called by a non-admin.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Admin towns management module (CRUD) for curated towns list",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}