{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-08T12:10:42.871Z",
  "summary": "Frontend adds a new admin-only /admin/retailers route and UI for registering retailers, listing them, editing details, and confirming removal. It also adds SA province constants and a reusable searchable select used in the Admin Dashboard listing creation flow. Backend diff shown does not evidence the required retailer-management APIs, expanded retailer model (hours/holidays), open/closed checks, or migration logic.",
  "missing_requirements": [
    {
      "id": "REQ-89",
      "requirement": "Add backend APIs to support retailer management: list all retailers, update an existing retailer, and remove an existing retailer; restrict all retailer mutation endpoints to admin callers.",
      "reason": "The backend diff excerpt only shows the existing Retailer type (id/name/townSuburb/province) and does not show any new query/mutation methods for listing all retailers, updating, or removing retailers with admin-only traps.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-90",
      "requirement": "Add full per-day retailer operating hours (Mon–Sun) with additional holiday-specific overrides, store them on the retailer model, and make them editable from the admin Retailers section.",
      "reason": "Frontend adds an hours editor UI, but the edit dialog explicitly contains a TODO to load existing hours from the retailer when backend supports it, and the backend Retailer type shown is not expanded to include weekly hours or holiday overrides.",
      "evidence": [
        "frontend/src/components/admin/RetailerEditDialog.tsx",
        "frontend/src/components/admin/RetailerHoursEditor.tsx",
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-91",
      "requirement": "Prevent customers from placing orders while a retailer is closed by adding backend-level “retailer open” checks and frontend visibility of open/closed status on retailer browsing pages.",
      "reason": "No diff evidence shows a backend query to determine if a retailer is currently open or a reusable backend guard/check, and no changes are shown on shop browsing pages to display open/closed status or gate ordering paths.",
      "evidence": [
        "backend/main.mo",
        "frontend/src/hooks/useQueries.ts",
        "frontend-file-summaries.txt"
      ]
    },
    {
      "id": "REQ-94",
      "requirement": "Update backend state persistence safely to support the expanded retailer model (operating hours + holiday overrides) for existing canister state by adding/adjusting conditional migration logic.",
      "reason": "No migration file changes are present, and the backend Retailer type shown is not expanded; there is no diff evidence of upgrade logic to backfill default hours/empty overrides for existing retailer records.",
      "evidence": [
        "backend/main.mo"
      ]
    }
  ],
  "hallucinated_features": [],
  "confidence": 0.72,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/App.tsx",
    "frontend/src/components/admin/RetailerEditDialog.tsx",
    "frontend/src/components/admin/RetailerHoursEditor.tsx",
    "frontend/src/components/admin/SearchableSelect.tsx",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/admin/AdminRetailersPage.tsx",
    "frontend/src/pages/shop/AdminDashboardPage.tsx",
    "frontend/src/utils/saProvinces.ts",
    "project_state.json"
  ]
}